{"edges": [[0, 1], [0, 2], [0, 3], [1, 4], [1, 3], [1, 0], [1, 2], [1, 3], [2, 0], [2, 1], [2, 3], [3, 4], [3, 1], [3, 0], [3, 1], [3, 2]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4"}, "count": 1, "cite": 5, "position": 1.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.4, "totalCite": 6.5, "totalPosition": 3.5, "paper": [{"title": "VIBR: Visualizing Bipartite Relations at Scale with the Minimum Description Length Principle", "author": ["Chan,GromitYeuk-Yin", "Xu,Panpan", "Dai,Zeng", "Ren,Liu"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864826", "keywords": "", "abstract": "Bipartite graphs model the key relations in many large scale real-world data: customers purchasing items, legislators voting for bills, people's affiliation with different social groups, faults occurring in vehicles, etc. However, it is challenging to visualize large scale bipartite graphs with tens of thousands or even more nodes or edges. In this paper, we propose a novel visual summarization technique for bipartite graphs based on the minimum description length (MDL) principle. The method simultaneously groups the two different set of nodes and constructs aggregated bipartite relations with balanced granularity and precision. It addresses the key trade-off that often occurs for visualizing large scale and noisy data: acquiring a clear and uncluttered overview while maximizing the information content in it. We formulate the visual summarization task as a co-clustering problem and propose an efficient algorithm based on locality sensitive hashing (LSH) that can easily scale to large graphs under reasonable interactive time constraints that previous related methods cannot satisfy. The method leads to the opportunity of introducing a visual analytics framework with multiple levels-of-detail to facilitate interactive data exploration. In the framework, we also introduce a compact visual design inspired by adjacency list representation of graphs as the building block for a small multiples display to compare the bipartite relations for different subsets of data. We showcase the applicability and effectiveness of our approach by applying it on synthetic data with ground truth and performing case studies on real-world datasets from two application domains including roll-call vote record analysis and vehicle fault pattern analysis. Interviews with experts in the political science community and the automotive industry further highlight the benefits of our approach.", "cite": 5, "year": "2019"}], "name": "Chan,GromitYeuk-Yin", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "1", "target": "4"}, {"source": "1", "target": "3"}, {"source": "1", "target": "2"}, {"source": "2", "target": "3"}, {"source": "3", "target": "4"}], "year": 2019, "authorId": {"0": "Chan,GromitYeuk-Yin", "1": "Xu,Panpan", "2": "Dai,Zeng", "3": "Ren,Liu", "4": "Liu,Dongyu"}}