{"edges": [[0, 1], [0, 2], [0, 3], [0, 4], [1, 2], [1, 0], [1, 3], [1, 4], [2, 1], [2, 0], [2, 3], [2, 4], [3, 1], [3, 2], [3, 0], [3, 4], [4, 1], [4, 2], [4, 0], [4, 3]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4"}, "count": 1, "cite": 15, "position": 3.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.2, "totalCite": 15.0, "totalPosition": 5.0, "paper": [{"title": "Manifold: A Model-Agnostic Framework for Interpretation and Diagnosis of Machine Learning Models", "author": ["Zhang,Jiawei", "Wang,Yang", "Molino,Piero", "Li,Lezhi", "Ebert,DavidS."], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864499", "keywords": "", "abstract": "Interpretation and diagnosis of machine learning models have gained renewed interest in recent years with breakthroughs in new approaches. We present Manifold, a framework that utilizes visual analysis techniques to support interpretation, debugging, and comparison of machine learning models in a more transparent and interactive manner. Conventional techniques usually focus on visualizing the internal logic of a specific model type (i.e., deep neural networks). lacking the ability to extend to a more complex scenario where different model types are integrated. To this end, Manifold is designed as a generic framework that does not rely on or access the internal logic of the model and solely observes the input (i.e., instances or features) and the output (i.e., the predicted result and probability distribution). We describe the workflow of Manifold as an iterative process consisting of three major phases that are commonly involved in the model development and diagnosis process: inspection (hypothesis), explanation (reasoning), and refinement (verification). The visual components supporting these tasks include a scatterplot-based visual summary that overviews the models' outcome and a customizable tabular view that reveals feature discrimination. We demonstrate current applications of the framework on the classification and regression tasks and discuss other potential machine learning use scenarios where Manifold can be applied.", "cite": 15, "year": "2019"}], "name": "Molino,Piero", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "0", "target": "4"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "1", "target": "4"}, {"source": "2", "target": "3"}, {"source": "2", "target": "4"}, {"source": "3", "target": "4"}], "year": 2019, "authorId": {"0": "Molino,Piero", "1": "Zhang,Jiawei", "2": "Wang,Yang", "3": "Li,Lezhi", "4": "Ebert,DavidS."}}