{"edges": [[0, 1], [0, 2], [0, 3], [0, 4], [0, 5], [1, 0], [1, 2], [1, 3], [2, 1], [2, 0], [2, 3], [3, 1], [3, 0], [3, 2], [3, 6], [3, 7], [3, 8], [3, 9], [3, 10], [3, 11], [3, 12], [3, 13], [3, 14], [4, 15], [4, 16], [4, 5], [4, 5], [4, 0], [5, 4], [5, 15], [5, 16], [5, 4], [5, 0], [5, 17]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7", "8": "8", "9": "9", "10": "10", "11": "11", "12": "12", "13": "13", "14": "14", "15": "15", "16": "16", "17": "17"}, "count": 2, "cite": 13, "position": 2.5, "connect": 1.0, "totalConnect": 1.4782608695652173, "totalCount": 0.6666666666666666, "totalCite": 5.166666666666667, "totalPosition": 4.833333333333333, "paper": [{"title": "iForest: Interpreting Random Forests via Visual Analytics", "author": ["Zhao,Xun", "Wu,Yanhong", "Lee,DikLun", "Cui,Weiwei"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864475", "keywords": "", "abstract": "As an ensemble model that consists of many independent decision trees, random forests generate predictions by feeding the input to internal trees and summarizing their outputs. The ensemble nature of the model helps random forests outperform any individual decision tree. However, it also leads to a poor model interpretability, which significantly hinders the model from being used in fields that require transparent and explainable predictions, such as medical diagnosis and financial fraud detection. The interpretation challenges stem from the variety and complexity of the contained decision trees. Each decision tree has its unique structure and properties, such as the features used in the tree and the feature threshold in each tree node. Thus a data input may lead to a variety of decision paths. To understand how a final prediction is achieved, it is desired to understand and compare all decision paths in the context of all tree structures, which is a huge challenge for any users. In this paper, we propose a visual analytic system aiming at interpreting random forest models and predictions. In addition to providing users with all the tree information, we summarize the decision paths in random forests which eventually reflects the working mechanism of the model and reduces users mental burden of interpretation. To demonstrate the effectiveness of our system, two usage scenarios and a qualitative user study are conducted.", "cite": 8, "year": "2019"}, {"title": "Duet: Helping Data Analysis Novices Conduct Pairwise Comparisons by Minimal Specification", "author": ["Law,Po-Ming", "Basole,RahulC.", "Wu,Yanhong"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864526", "keywords": "", "abstract": "Data analysis novices often encounter barriers in executing low-level operations for pairwise comparisons. They may also run into barriers in interpreting the artifacts (e.g., visualizations) created as a result of the operations. We developed Duet, a visual analysis system designed to help data analysis novices conduct pairwise comparisons by addressing execution and interpretation barriers. To reduce the barriers in executing low-level operations during pairwise comparison, Duet employs minimal specification: when one object group (i.e. a group of records in a data table) is specified, Duet recommends object groups that are similar to or different from the specified one; when two object groups are specified, Duet recommends similar and different attributes between them. To lower the barriers in interpreting its recommendations, Duet explains the recommended groups and attributes using both visualizations and textual descriptions. We conducted a qualitative evaluation with eight participants to understand the effectiveness of Duet. The results suggest that minimal specification is easy to use and Duet's explanations are helpful for interpreting the recommendations despite some usability issues.", "cite": 5, "year": "2019"}], "name": "Wu,Yanhong", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}, {"id": "7"}, {"id": "8"}, {"id": "9"}, {"id": "10"}, {"id": "11"}, {"id": "12"}, {"id": "13"}, {"id": "14"}, {"id": "15"}, {"id": "16"}, {"id": "17"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "0", "target": "4"}, {"source": "0", "target": "5"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "2", "target": "3"}, {"source": "3", "target": "6"}, {"source": "3", "target": "7"}, {"source": "3", "target": "8"}, {"source": "3", "target": "9"}, {"source": "3", "target": "10"}, {"source": "3", "target": "11"}, {"source": "3", "target": "12"}, {"source": "3", "target": "13"}, {"source": "3", "target": "14"}, {"source": "4", "target": "15"}, {"source": "4", "target": "16"}, {"source": "4", "target": "5"}, {"source": "5", "target": "15"}, {"source": "5", "target": "16"}, {"source": "5", "target": "17"}], "year": 2019, "authorId": {"0": "Wu,Yanhong", "1": "Zhao,Xun", "2": "Lee,DikLun", "3": "Cui,Weiwei", "4": "Law,Po-Ming", "5": "Basole,RahulC.", "6": "Tang,Tan", "7": "Rubab,Sadia", "8": "Lai,Jiewen", "9": "Yu,Lingyun", "10": "Wu,Yingcai", "11": "Wang,Qianwen", "12": "Li,Zhen", "13": "Fu,Siwei", "14": "Qu,Huamin", "15": "Liu,Zhicheng", "16": "Malik,Sana", "17": "Major,Timothy"}}