{"edges": [[0, 1], [1, 0]], "features": {"0": "0", "1": "1"}, "count": 1, "cite": 2, "position": 2.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.5, "totalCite": 2.0, "totalPosition": 2.0, "paper": [{"title": "Shape-preserving Star Coordinates", "author": ["Molchanov,Vladimir", "Linsen,Lars"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2865118", "keywords": "", "abstract": "Dimensionality reduction is commonly applied to multidimensional data to reduce the complexity of their analysis. In visual analysis systems, projections embed multidimensional data into 2D or 3D spaces for graphical representation. To facilitate a robust and accurate analysis, essential characteristics of the multidimensional data shall be preserved when projecting. Orthographic star coordinates is a state-of-the-art linear projection method that avoids distortion of multidimensional clusters by restricting interactive exploration to orthographic projections. However, existing numerical methods for computing orthographic star coordinates have a number of limitations when putting them into practice. We overcome these limitations by proposing the novel concept of shape preserving star coordinates where shape preservation is assured using a superset of orthographic projections. Our scheme is explicit, exact, simple, fast, parameter-free, and stable. To maintain a valid shape-preserving star-coordinates configuration during user interaction with one of the star-coordinates axes, we derive an algorithm that only requires us to modify the configuration of one additional compensatory axis. Different design goals can be targeted by using different strategies for selecting the compensatory axis. We propose and discuss four strategies including a strategy that approximates orthographic star coordinates very well and a data-driven strategy. We further present shape-preserving morphing strategies between two shape-preserving configurations, which can be adapted for the generation of data tours. We apply our concept to multiple data analysis scenarios to document its applicability and validate its desired properties.", "cite": 2, "year": "2019"}], "name": "Linsen,Lars", "nodes": [{"id": "0"}, {"id": "1"}], "edgess": [{"source": "0", "target": "1"}], "year": 2019, "authorId": {"0": "Linsen,Lars", "1": "Molchanov,Vladimir"}}