{"edges": [[0, 1], [0, 2], [0, 3], [0, 4], [0, 5], [1, 2], [1, 0], [2, 1], [2, 0], [3, 6], [3, 7], [3, 8], [3, 9], [3, 4], [3, 5], [3, 0], [3, 10], [3, 11], [3, 12], [3, 13], [4, 3], [4, 5], [4, 0], [5, 3], [5, 4], [5, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7", "8": "8", "9": "9", "10": "10", "11": "11", "12": "12", "13": "13"}, "count": 2, "cite": 11, "position": 3.5, "connect": 1.0, "totalConnect": 1.5294117647058822, "totalCount": 0.35714285714285715, "totalCite": 8.6, "totalPosition": 4.2, "paper": [{"title": "DimReader: Axis lines that explain non-linear projections", "author": ["Faust,Rebecca", "Glickenstein,David", "Scheidegger,Carlos"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2865194", "keywords": "", "abstract": "Non-linear dimensionality reduction (NOR) methods such as LLE and t-SNE are popular with visualization researchers and experienced data analysts, but present serious problems of interpretation. In this paper, we present DimReader, a technique that recovers readable axes from such techniques. DimReader is based on analyzing infinitesimal perturbations of the dataset with respect to variables of interest. The perturbations define exactly how we want to change each point in the original dataset and we measure the effect that these changes have on the projection. The recovered axes are in direct analogy with the axis lines (grid lines) of traditional scatterplots. We also present methods for discovering perturbations on the input data that change the projection the most. The calculation of the perturbations is efficient and easily integrated into programs written in modern programming languages. We present results of DimReader on a variety of NDR methods and datasets both synthetic and real-life, and show how it can be used to compare different NDR methods. Finally, we discuss limitations of our proposal and situations where further research is needed.", "cite": 5, "year": "2019"}, {"title": "Looks Good To Me: Visualizations As Sanity Checks", "author": ["Correll,Michael", "Li,Mingwei", "Kindlmann,Gordon", "Scheidegger,Carlos"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864907", "keywords": "", "abstract": "Famous examples such as Anscombe's Quartet highlight that one of the core benefits of visualizations is allowing people to discover visual patterns that might otherwise be hidden by summary statistics. This visual inspection is particularly important in exploratory data analysis, where analysts can use visualizations such as histograms and dot plots to identify data quality issues. Yet, these visualizations are driven by parameters such as histogram bin size or mark opacity that have a great deal of impact on the final visual appearance of the chart, but are rarely optimized to make important features visible. In this paper, we show that data flaws have varying impact on the visual features of visualizations, and that the adversarial or merely uncritical setting of design parameters of visualizations can obscure the visual signatures of these flaws. Drawing on the framework of Algebraic Visualization Design, we present the results of a crowdsourced study showing that common visualization types can appear to reasonably summarize distributional data while hiding large and important flaws such as missing data and extraneous modes. We make use of these results to propose additional best practices for visualizations of distributions for data quality tasks.", "cite": 6, "year": "2019"}], "name": "Scheidegger,Carlos", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}, {"id": "7"}, {"id": "8"}, {"id": "9"}, {"id": "10"}, {"id": "11"}, {"id": "12"}, {"id": "13"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "0", "target": "4"}, {"source": "0", "target": "5"}, {"source": "1", "target": "2"}, {"source": "3", "target": "6"}, {"source": "3", "target": "7"}, {"source": "3", "target": "8"}, {"source": "3", "target": "9"}, {"source": "3", "target": "4"}, {"source": "3", "target": "5"}, {"source": "3", "target": "10"}, {"source": "3", "target": "11"}, {"source": "3", "target": "12"}, {"source": "3", "target": "13"}, {"source": "4", "target": "5"}], "year": 2019, "authorId": {"0": "Scheidegger,Carlos", "1": "Faust,Rebecca", "2": "Glickenstein,David", "3": "Correll,Michael", "4": "Li,Mingwei", "5": "Kindlmann,Gordon", "6": "Sarikaya,Alper", "7": "Bartram,Lyn", "8": "Tory,Melanie", "9": "Fisher,Danyel", "10": "Hullman,Jessica", "11": "Qiao,Xiaoli", "12": "Kale,Alex", "13": "Kay,Matthew"}}