{"edges": [[0, 1], [0, 2], [1, 2], [1, 0], [2, 1], [2, 0]], "features": {"0": "0", "1": "1", "2": "2"}, "count": 1, "cite": 8, "position": 3.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.3333333333333333, "totalCite": 8.0, "totalPosition": 3.0, "paper": [{"title": "IDMVis: Temporal Event Sequence Visualization for Type 1 Diabetes Treatment Decision Support", "author": ["Zhang,Yixuan", "Chanana,Kartik", "Dunne,Cody"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2865076", "keywords": "", "abstract": "Type 1 diabetes is a chronic, incurable autoimmune disease affecting millions of Americans in which the body stops producing insulin and blood glucose levels rise. The goal of intensive diabetes management is to lower average blood glucose through frequent adjustments to insulin protocol. diet. and behavior. Manual logs and medical device data are collected by patients, but these multiple sources are presented in disparate visualization designs to the clinician making temporal inference difficult. We conducted a design study over 18 months with clinicians performing intensive diabetes management. We present a data abstraction and novel hierarchical task abstraction for this domain. We also contribute IDMVis: a visualization tool for temporal event sequences with multidimensional. interrelated data. IDMVis includes a novel technique for folding and aligning records by dual sentinel events and scaling the intermediate timeline. We validate our design decisions based on our domain abstractions, best practices, and through a qualitative evaluation with six clinicians. The results of this study indicate that IDMVis accurately reflects the workflow of clinicians. Using IDMVis, clinicians are able to identify issues of data quality such as missing or conflicting data; reconstruct patient records when data is missing, differentiate between days with different patterns; and promote educational interventions after identifying discrepancies.", "cite": 8, "year": "2019"}], "name": "Dunne,Cody", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "2"}], "year": 2019, "authorId": {"0": "Dunne,Cody", "1": "Zhang,Yixuan", "2": "Chanana,Kartik"}}