{"edges": [[0, 1], [1, 2], [1, 3], [1, 4], [1, 2], [1, 5], [1, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5"}, "count": 1, "cite": 3, "position": 1.0, "connect": 1.0, "totalConnect": 1.4, "totalCount": 0.8333333333333334, "totalCite": 4.4, "totalPosition": 3.2, "paper": [{"title": "Graphicle: Exploring Units, Networks, and Context in a Blended Visualization Approach", "author": ["Major,Timothy", "Basole,RahulC."], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2865151", "keywords": "", "abstract": "Many real-world datasets are large, multivariate, and relational in nature and relevant associated decisions frequently require a simultaneous consideration of both attributes and connections. Existing visualization systems and approaches, however, often make an explicit trade-off between either affording rich exploration of individual data units and their attributes or exploration of the underlying network structure. In doing so, important analysis opportunities and insights are potentially missed. In this study, we aim to address this gap by (1) considering visualizations and interaction techniques that blend the spectrum between unit and network visualizations, (2) discussing the nature of different forms of contexts and the challenges in implementing them, and (3) demonstrating the value of our approach for visual exploration of multivariate, relational data for a real-world use case. Specifically, we demonstrate through a system called Graphicle how network structure can be layered on top of unit visualization techniques to create new opportunities for visual exploration of physician characteristics and referral data. We report on the design, implementation, and evaluation of the system and effectiveness of our blended approach.", "cite": 3, "year": "2019"}], "name": "Major,Timothy", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}], "edgess": [{"source": "0", "target": "1"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "1", "target": "4"}, {"source": "1", "target": "5"}], "year": 2019, "authorId": {"0": "Major,Timothy", "1": "Basole,RahulC.", "2": "Law,Po-Ming", "3": "Liu,Zhicheng", "4": "Malik,Sana", "5": "Wu,Yanhong"}}