{"edges": [[0, 1], [0, 2], [1, 0], [1, 2], [2, 3], [2, 4], [2, 5], [2, 6], [2, 1], [2, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6"}, "count": 1, "cite": 5, "position": 2.0, "connect": 1.0, "totalConnect": 1.4285714285714286, "totalCount": 0.42857142857142855, "totalCite": 5.333333333333333, "totalPosition": 3.6666666666666665, "paper": [{"title": "Design Exposition with Literate Visualization", "author": ["Wood,Jo", "Kachkaev,Alexander", "Dykes,Jason"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864836", "keywords": "", "abstract": "We propose a new approach to the visualization design and communication process, literate visualization, based upon and extending, Donald Knuth's idea of literate programming. It integrates the process of writing data visualization code with description of the design choices that led to the implementation (design exposition). We develop a model of design exposition characterised by four visualization designer architypes: the evaluator, the autonomist, the didacticist and the rationalist. The model is used to justify the key characteristics of literate visualization: 'notebook' documents that integrate live coding input, rendered output and textual narrative; low cost of authoring textual narrative; guidelines to encourage structured visualization design and its documentation. We propose narrative schemas for structuring and validating a wide range of visualization design approaches and models, and branching narratives for capturing alternative designs and design views. We describe a new open source literate visualization environment, litvis, based on a declarative interface to Vega and Vega-Lite through the functional programming language Elm combined with markdown for formatted narrative. We informally assess the approach, its implementation and potential by considering three examples spanning a range of design abstractions: new visualization idioms; validation though visualization algebra; and feminist data visualization. We argue that the rich documentation of the design process provided by literate visualization offers the potential to improve the validity of visualization design and so benefit both academic visualization and visualization practice.", "cite": 5, "year": "2019"}], "name": "Kachkaev,Alexander", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "2"}, {"source": "2", "target": "3"}, {"source": "2", "target": "4"}, {"source": "2", "target": "5"}, {"source": "2", "target": "6"}], "year": 2019, "authorId": {"0": "Kachkaev,Alexander", "1": "Wood,Jo", "2": "Dykes,Jason", "3": "Kerzner,Ethan", "4": "Goodwin,Sarah", "5": "Jones,Sara", "6": "Meyer,Miriah"}}