{"edges": [[0, 1], [0, 2], [1, 0], [1, 2], [2, 3], [2, 4], [2, 5], [2, 6], [2, 0], [2, 1]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6"}, "count": 1, "cite": 6, "position": 1.0, "connect": 1.0, "totalConnect": 1.4285714285714286, "totalCount": 0.42857142857142855, "totalCite": 5.333333333333333, "totalPosition": 3.6666666666666665, "paper": [{"title": "A Framework for Externalizing Implicit Error Using Visualization", "author": ["McCurdy,Nina", "Gerdes,Julie", "Meyer,Miriah"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864913", "keywords": "", "abstract": "This paper presents a framework for externalizing and analyzing expert knowledge about discrepancies in data through the use of visualization. Grounded in an 18-month design study with global health experts, the framework formalizes the notion of data discrepancies as implicit error, both in global health data and more broadly. We use the term implicit error to describe measurement error that is inherent to and pervasive throughout a dataset, but that isn't explicitly accounted for or defined. Instead, implicit error exists in the minds of experts, is mainly qualitative, and is accounted for subjectively during expert interpretation of the data. Externalizing knowledge surrounding implicit error can assist in synchronizing, validating, and enhancing interpretation, and can inform error analysis and mitigation. The framework consists of a description of implicit error components that are important for downstream analysis, along with a process model for externalizing and analyzing implicit error using visualization. As a second contribution, we provide a rich, reflective, and verifiable description of our research process as an exemplar summary toward the ongoing inquiry into ways of increasing the validity and transferability of design study research.", "cite": 6, "year": "2019"}], "name": "McCurdy,Nina", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "2"}, {"source": "2", "target": "3"}, {"source": "2", "target": "4"}, {"source": "2", "target": "5"}, {"source": "2", "target": "6"}], "year": 2019, "authorId": {"0": "McCurdy,Nina", "1": "Gerdes,Julie", "2": "Meyer,Miriah", "3": "Kerzner,Ethan", "4": "Goodwin,Sarah", "5": "Dykes,Jason", "6": "Jones,Sara"}}