{"edges": [[0, 1], [0, 2], [1, 0], [1, 2], [2, 1], [2, 0], [2, 3]], "features": {"0": "0", "1": "1", "2": "2", "3": "3"}, "count": 1, "cite": 1, "position": 2.0, "connect": 1.0, "totalConnect": 1.75, "totalCount": 0.75, "totalCite": 1.0, "totalPosition": 3.0, "paper": [{"title": "Recirculation Surfaces for Flow Visualization", "author": ["Wilde,Thomas", "Rossl,Christian", "Theisel,Holger"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864813", "keywords": "", "abstract": "We present a formal approach to the visual analysis of recirculation in flows by introducing recirculation surfaces for 3D unsteady flow fields. Recirculation surfaces are the loci where massless particle integration returns to its starting point after some variable, finite integration. We give a rigorous definition of recirculation surfaces as 2 -manifolds embedded in 5D space and study their properties. Based on this we construct an algorithm for their extraction, which searches for intersections of a recirculation surface with lines defined in 3D. This reduces the problem to a repeated search for critical points in 3D vector fields. We provide a uniform sampling of the search space paired with a surface reconstruction and visualize results. This way, we present the first algorithm for a comprehensive feature extraction in the 5D flow map of a 3D flow. The problem of finding isolated closed orbits in steady vector fields occurs as a special case of recirculation surfaces. This includes isolated closed orbits with saddle behavior. We show recirculation surfaces for a number of artificial and real flow data sets.", "cite": 1, "year": "2019"}], "name": "Rossl,Christian", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "2"}, {"source": "2", "target": "3"}], "year": 2019, "authorId": {"0": "Rossl,Christian", "1": "Wilde,Thomas", "2": "Theisel,Holger", "3": "Guenther,Tobias"}}