{"edges": [[0, 1], [0, 2], [0, 3], [1, 0], [1, 2], [1, 3], [2, 0], [2, 1], [2, 3], [3, 0], [3, 1], [3, 2]], "features": {"0": "0", "1": "1", "2": "2", "3": "3"}, "count": 1, "cite": 6, "position": 1.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.25, "totalCite": 6.0, "totalPosition": 4.0, "paper": [{"title": "Interactive Visualization of RNA and DNA Structures", "author": ["Lindow,Norbert", "Baum,Daniel", "Leborgne,Morgan", "Hege,Hans-Christian"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864507", "keywords": "", "abstract": "The analysis and visualization of nucleic acids (RNA and DNA) is playing an increasingly important role due to their fundamental importance for all forms of life and the growing number of known 3D structures of such molecules. The great complexity of these structures, in particular, those of RNA, demands interactive visualization to get deeper insights into the relationship between the 2D secondary structure motifs and their 3D tertiary structures. Over the last decades, a lot of research in molecular visualization has focused on the visual exploration of protein structures while nucleic acids have only been marginally addressed. In contrast to proteins, which are composed of amino acids, the ingredients of nucleic acids are nucleotides. They form structuring patterns that differ from those of proteins and, hence, also require different visualization and exploration techniques. In order to support interactive exploration of nucleic acids, the computation of secondary structure motifs as well as their visualization in 2D and 3D must be fast. Therefore, in this paper, we focus on the performance of both the computation and visualization of nucleic acid structure. We present a ray casting-based visualization of RNA and DNA secondary and tertiary structures, which enables for the first time real-time visualization of even large molecular dynamics trajectories. Furthermore, we provide a detailed description of all important aspects to visualize nucleic acid secondary and tertiary structures. With this, we close an important gap in molecular visualization.", "cite": 6, "year": "2019"}], "name": "Lindow,Norbert", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "2", "target": "3"}], "year": 2019, "authorId": {"0": "Lindow,Norbert", "1": "Baum,Daniel", "2": "Leborgne,Morgan", "3": "Hege,Hans-Christian"}}