{"edges": [[0, 1], [0, 2], [0, 3], [1, 2], [1, 3], [1, 0], [2, 1], [2, 3], [2, 0], [3, 1], [3, 2], [3, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3"}, "count": 1, "cite": 0, "position": 4.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.25, "totalCite": 0.0, "totalPosition": 4.0, "paper": [{"title": "Robust and Fast Extraction of 3D Symmetric Tensor Field Topology", "author": ["Roy,Lawrence", "Kumar,Prashant", "Zhang,Yue", "Zhang,Eugene"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864768", "keywords": "", "abstract": "3D symmetric tensor fields appear in many science and engineering fields, and topology-driven analysis is important in many of these application domains, such as solid mechanics and fluid dynamics. Degenerate curves and neutral surfaces are important topological features in 3D symmetric tensor fields. Existing methods to extract degenerate curves and neutral surfaces often miss parts of the curves and surfaces, respectively. Moreover, these methods are computationally expensive due to the lack of knowledge of structures of degenerate curves and neutral surfaces. In this paper, we provide theoretical analysis on the geometric and topological structures of degenerate curves and neutral surfaces of 3D linear tensor fields. These structures lead to parameterizations for degenerate curves and neutral surfaces that can not only provide more robust extraction of these features but also incur less computational cost. We demonstrate the benefits of our approach by applying our degenerate curve and neutral surface detection techniques to solid mechanics simulation data sets.", "cite": 0, "year": "2019"}], "name": "Zhang,Eugene", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "2", "target": "3"}], "year": 2019, "authorId": {"0": "Zhang,Eugene", "1": "Roy,Lawrence", "2": "Kumar,Prashant", "3": "Zhang,Yue"}}