{"edges": [[0, 1], [1, 2], [1, 3], [1, 4], [1, 5], [1, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5"}, "count": 1, "cite": 2, "position": 1.0, "connect": 1.0, "totalConnect": 1.2, "totalCount": 0.5, "totalCite": 2.0, "totalPosition": 4.666666666666667, "paper": [{"title": "Probabilistic Asymptotic Decider for Topological Ambiguity Resolution in Level-Set Extraction for Uncertain 2D Data", "author": ["Athawale,Tushar", "Johnson,ChrisR."], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864505", "keywords": "", "abstract": "We present a framework for the analysis of uncertainty in isocontour extraction. The marching squares (MS) algorithm for isocontour reconstruction generates a linear topology that is consistent with hyperbolic curves of a piecewise bilinear interpolation. The saddle points of the bilinear interpolant cause topological ambiguity in isocontour extraction. The midpoint decider and the asymptotic decider are well-known mathematical techniques for resolving topological ambiguities. The latter technique investigates the data values at the cell saddle points for ambiguity resolution. The uncertainty in data. however, leads to uncertainty in underlying bilinear interpolation functions for the MS algorithm, and hence, their saddle points. In our work, we study the behavior of the asymptotic decider when data at grid vertices is uncertain. First, we derive closed-form distributions characterizing variations in the saddle point values for uncertain bilinear interpolants. The derivation assumes uniform and nonparametric noise models, and it exploits the concept of ratio distribution for analytic formulations. Next. the probabilistic asymptotic decider is devised for ambiguity resolution in uncertain data using distributions of the saddle point values derived in the first step. Finally, the confidence in probabilistic topological decisions is visualized using a colormapping technique. We demonstrate the higher accuracy and stability of the probabilistic asymptotic decider in uncertain data with regard to existing decision frameworks. such as deciders in the mean field and the probabilistic midpoint decider, through the isocontour visualization of synthetic and real datasets.", "cite": 2, "year": "2019"}], "name": "Athawale,Tushar", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}], "edgess": [{"source": "0", "target": "1"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "1", "target": "4"}, {"source": "1", "target": "5"}], "year": 2019, "authorId": {"0": "Athawale,Tushar", "1": "Johnson,ChrisR.", "2": "Wang,Feng", "3": "Wald,Ingo", "4": "Wu,Qi", "5": "Usher,Will"}}