{"edges": [[0, 1], [1, 2], [1, 3], [1, 4], [1, 5], [1, 6], [1, 7], [1, 0], [1, 8], [1, 9], [1, 10]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7", "8": "8", "9": "9", "10": "10"}, "count": 1, "cite": 2, "position": 1.0, "connect": 1.0, "totalConnect": 1.1, "totalCount": 0.45454545454545453, "totalCite": 2.6, "totalPosition": 3.8, "paper": [{"title": "Hexahedral Mesh Structure Visualization and Evaluation", "author": ["Xu,Kaoji", "Chen,Guoning"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864827", "keywords": "", "abstract": "Understanding hexahedral (hex-) mesh structures is important for a number of hex-mesh generation and optimization tasks. However, due to various configurations of the singularities in a valid pure hex-mesh, the structure (or base complex) of the mesh can be arbitrarily complex. In this work, we present a first and effective method to help meshing practitioners understand the possible configurations in a valid 3D base complex for the characterization of their complexity. In particular, we propose a strategy to decompose the complex hex-mesh structure into multi-level sub-structures so that they can be studied separately, from which we identify a small set of the sub-structures that can most efficiently represent the whole mesh structure. Furthermore, from this set of sub-structures, we attempt to define the first metric for the quantification of the complexity of hex-mesh structure. To aid the exploration of the extracted multi-level structure information, we devise a visual exploration system coupled with a matrix view to help alleviate the common challenge of 3D data exploration (e.g., clutter and occlusion). We have applied our tool and metric to a large number of hex-meshes generated with different approaches to reveal different characteristics of these methods in terms of the mesh structures they can produce. We also use our metric to assess the existing structure simplification techniques in terms of their effectiveness.", "cite": 2, "year": "2019"}], "name": "Xu,Kaoji", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}, {"id": "7"}, {"id": "8"}, {"id": "9"}, {"id": "10"}], "edgess": [{"source": "0", "target": "1"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "1", "target": "4"}, {"source": "1", "target": "5"}, {"source": "1", "target": "6"}, {"source": "1", "target": "7"}, {"source": "1", "target": "8"}, {"source": "1", "target": "9"}, {"source": "1", "target": "10"}], "year": 2019, "authorId": {"0": "Xu,Kaoji", "1": "Chen,Guoning", "2": "Shi,Lieyu", "3": "SLaramee,Robert", "4": "Govyadinov,PavelA.", "5": "Womack,Tasha", "6": "Eriksen,JasonL.", "7": "Mayerich,David", "8": "Berenjkoub,Marzieh", "9": "Monico,RodolfoOstilla", "10": "Laramee,RobertS."}}