{"edges": [[0, 1], [0, 2], [1, 0], [1, 2], [2, 3], [2, 4], [2, 5], [2, 1], [2, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5"}, "count": 1, "cite": 1, "position": 2.0, "connect": 1.0, "totalConnect": 1.5, "totalCount": 0.5, "totalCite": 2.3333333333333335, "totalPosition": 4.333333333333333, "paper": [{"title": "Firefly: Virtual Illumination Drones for Interactive Visualization", "author": ["Stoppel,Sergej", "Erga,MagnusPaulson", "Bruckner,Stefan"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864656", "keywords": "", "abstract": "Light specification in three dimensional scenes is a complex problem and several approaches have been presented that aim to automate this process. However, there are many scenarios where a static light setup is insufficient, as the scene content and camera position may change. Simultaneous manual control over the camera and light position imposes a high cognitive load on the user. To address this challenge, we introduce a novel approach for automatic scene illumination with Fireflies. Fireflies are intelligent virtual light drones that illuminate the scene by traveling on a closed path. The Firefly path automatically adapts to changes in the scene based on an outcome-oriented energy function. To achieve interactive performance, we employ a parallel rendering pipeline for the light path evaluations. We provide a catalog of energy functions for various application scenarios and discuss the applicability of our method on several examples.", "cite": 1, "year": "2019"}], "name": "Erga,MagnusPaulson", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "2"}, {"source": "2", "target": "3"}, {"source": "2", "target": "4"}, {"source": "2", "target": "5"}], "year": 2019, "authorId": {"0": "Erga,MagnusPaulson", "1": "Stoppel,Sergej", "2": "Bruckner,Stefan", "3": "Isenberg,Tobias", "4": "Ropinski,Timo", "5": "Wiebel,Alexander"}}