{"edges": [[0, 1], [0, 2], [1, 0], [1, 2], [2, 0], [2, 1]], "features": {"0": "0", "1": "1", "2": "2"}, "count": 1, "cite": 0, "position": 1.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.3333333333333333, "totalCite": 0.0, "totalPosition": 3.0, "paper": [{"title": "Automated Geometric Registration for Multi-Projector Displays on Arbitrary 3D Shapes Using Uncalibrated Devices.", "author": ["AbbaspourTehrani,Mahdi", "M,Gopi", "Majumder,Aditi"], "soname": "IEEE transactions on visualization and computer graphics", "DOI": "10.1109/TVCG.2019.2950942", "keywords": "", "abstract": "In this paper we present a completely automated and scalable multi-projector registration system that allows multiple completely uncalibrated projectors and cameras on arbitrary shape surfaces. Our method estimates the parameters of multiple uncalibrated tiled or superimposed projectors, the parameters of the observing cameras, the shape of the illuiminated 3D geometry and geometrically registers the projectors on it. This is achieved without using any fiducials, even if part of the surface is visible to only one camera. The method uses a completely automatic approach for cross-correlation and cross-validation of the device parameters and the surface geometry resulting in an accurate registration on the arbitrary unknown geometry that does not need an accurate prior calibration of each of the uncalibrated devices using physical patterns or fiducials. Estimating projector parameters allows for quick recalibration of the system in the face of projector movements, by re-estimating only the parameters of the moved projector and not the entire system. Thus, our work can enable easy deployment of spatially augmented reality environments of different sizes (from small table top objects to large immersive environments), different shapes (inside-looking-out or outside-looking in), and different configurations (tiled or superimposed) using the same proposed method.", "cite": 0, "year": "2019"}], "name": "AbbaspourTehrani,Mahdi", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "2"}], "year": 2019, "authorId": {"0": "AbbaspourTehrani,Mahdi", "1": "M,Gopi", "2": "Majumder,Aditi"}}