{"edges": [[0, 1], [0, 2], [0, 3], [0, 2], [1, 0], [1, 2], [2, 1], [2, 0], [2, 3], [2, 0], [3, 0], [3, 2], [2, 1], [2, 0], [2, 3], [2, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3"}, "count": 2, "cite": 0, "position": 2.0, "connect": 1.3333333333333333, "totalConnect": 3.2, "totalCount": 0.5, "totalCite": 0.0, "totalPosition": 3.0, "paper": [{"title": "Expressive Authoring of Node-Link Diagrams with Graphies.", "author": ["Romat,Hugo", "Appert,Caroline", "Pietriga,Emmanuel"], "soname": "IEEE transactions on visualization and computer graphics", "DOI": "10.1109/TVCG.2019.2950932", "keywords": "", "abstract": "Expressive design environments enable visualization designers not only to specify chart types and visual mappings, but also to customize individual graphical marks, as they would in a vector graphics drawing tool. Prior work has mainly investigated how to support the expressive design of a wide range of charts generated from tabular data: bar charts, scatterplots, maps, etc. We focus here on an expressive design environment for node-link diagrams generated from multivariate networks. Such data structures raise specific challenges and opportunities in terms of visual design and interactive authoring. We discuss those specificities and describe the user-centered design process that led to Graphies, a prototype environment for expressive node-link diagram authoring. We then report on a study in which participants successfully reproduced several expressive designs, and created their own designs as well.", "cite": 0, "year": "2019"}, {"title": "Animation Plans for Before-and-After Satellite Images", "author": ["Lobo,Maria-Jesus", "Appert,Caroline", "Pietriga,Emmanuel"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2796557", "keywords": "", "abstract": "Before-and-after image pairs show how entities in a given region have evolved over a specific period of time. Satellite images are a major source of such data, that capture how natural phenomena or human activity impact a geographical area. These images are used both for data analysis and to illustrate the resulting findings to diverse audiences. The simple techniques used to display them, including juxtaposing, swapping and monolithic blending, often fail to convey the underlying phenomenon in a meaningful manner. We introduce Baia, a framework to create advanced animated transitions, called animation plans, between before-and-after images. Baia relies on a pixel-based transition model that gives authors much expressive power, while keeping animations for common types of changes easy to create thanks to predefined animation primitives. We describe our model, the associated animation editor, and report on two user studies. In the first study, advanced transitions enabled by Baia were compared to monolithic blending, and perceived as more realistic and better at focusing viewer's attention on a region of interest than the latter. The second study aimed at gathering feedback about the usability of Baia's animation editor.", "cite": 0, "year": "2019"}], "name": "Appert,Caroline", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "1", "target": "2"}, {"source": "2", "target": "3"}], "year": 2019, "authorId": {"0": "Appert,Caroline", "1": "Romat,Hugo", "2": "Pietriga,Emmanuel", "3": "Lobo,Maria-Jesus"}}