{"edges": [[0, 1], [0, 2], [1, 0], [1, 2], [2, 1], [2, 0], [2, 3], [2, 4], [2, 5], [2, 3], [2, 6], [2, 7]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7"}, "count": 1, "cite": 0, "position": 2.0, "connect": 1.0, "totalConnect": 1.5, "totalCount": 0.375, "totalCite": 1.0, "totalPosition": 3.6666666666666665, "paper": [{"title": "AR HMD Guidance for Controlled Hand-Held 3D Acquisition", "author": ["Andersen,Daniel", "Villano,Peter", "Popescu,Voicu"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2019.2932172", "keywords": "", "abstract": "Photogrammetry is a popular method of 3D reconstruction that uses conventional photos as input. This method can achieve high quality reconstructions so long as the scene is densely acquired from multiple views with sufficient overlap between nearby images. However, it is challenging for a human operator to know during acquisition if sufficient coverage has been achieved. Insufficient coverage of the scene can result in holes, missing regions, or even a complete failure of reconstruction. These errors require manually repairing the model or returning to the scene to acquire additional views, which is time-consuming and often infeasible. We present a novel approach to photogrammetric acquisition that uses an AR HMD to predict a set of covering views and to interactively guide an operator to capture imagery from each view. The operator wears an AR HMD and uses a handheld camera rig that is tracked relative to the AR HMD with a fiducial marker. The AR HMD tracks its pose relative to the environment and automatically generates a coarse geometric model of the scene, which our approach analyzes at runtime to generate a set of human-reachable acquisition views covering the scene with consistent camera-to-scene distance and image overlap. The generated view locations are rendered to the operator on the AR HMD. Interactive visual feedback informs the operator how to align the camera to assume each suggested pose. When the camera is in range, an image is automatically captured. In this way, a set of images suitable for 3D reconstruction can be captured in a matter of minutes. In a user study, participants who were novices at photogrammetry were tasked with acquiring a challenging and complex scene either without guidance or with our AR HMD based guidance. Participants using our guidance achieved improved reconstructions without cases of reconstruction failure as in the control condition. Our AR HMD based approach is self-contained, portable, and provides specific acquisition guidance tailored to the geometry of the scene being captured.", "cite": 0, "year": "2019"}], "name": "Villano,Peter", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}, {"id": "7"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "2"}, {"source": "2", "target": "3"}, {"source": "2", "target": "4"}, {"source": "2", "target": "5"}, {"source": "2", "target": "6"}, {"source": "2", "target": "7"}], "year": 2019, "authorId": {"0": "Villano,Peter", "1": "Andersen,Daniel", "2": "Popescu,Voicu", "3": "Wang,Lili", "4": "Liang,Xinglun", "5": "Meng,Chunlei", "6": "Wu,Jian", "7": "Yang,Xuefeng"}}