{"edges": [[0, 1], [0, 2], [0, 3], [1, 2], [1, 0], [1, 3], [1, 3], [1, 4], [1, 5], [2, 1], [2, 0], [2, 3], [3, 1], [3, 2], [3, 0], [3, 4], [3, 1], [3, 5]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5"}, "count": 1, "cite": 0, "position": 3.0, "connect": 1.0, "totalConnect": 1.8, "totalCount": 0.3333333333333333, "totalCite": 5.0, "totalPosition": 4.0, "paper": [{"title": "Implicit Density Projection for Volume Conserving Liquids.", "author": ["Kugelstadt,Tassilo", "Longva,Andreas", "Thurey,Nils", "Bender,Jan"], "soname": "IEEE transactions on visualization and computer graphics", "DOI": "10.1109/TVCG.2019.2947437", "keywords": "", "abstract": "We propose a novel implicit density projection approach for hybrid methods like FLIP and APIC to enforce volume conservation of incompressible liquids. A problem of the standard divergence-free pressure solver is that it only has a differential view on density changes. Numerical volume errors, which occur due to large time steps and limited accuracy of pressure projections, are invisible to the solver and cannot be corrected. Moreover, these errors accumulate over time and can lead to drastic volume changes. The proposed method enforces constant density throughout the fluid by tracking density via the particles of the simulator. We use the continuous mass conservation law to derive a pressure Poisson equation which also penalizes density deviations. It can be discretized with standard approaches and easily implemented into existing code. Our method enables us to relax the strict time step and solver accuracy requirements of a regular solver, leading to significantly higher performance. Moreover, our approach is able to robustly recover from degenerate configurations, can push fluid particles out of solid obstacles without losing volume, and generates more uniform particle distributions. Comparisons with FLIP, APIC and previous volume correction approaches demonstrate significant improvements in terms of incompressibility, visual realism and computational performance.", "cite": 0, "year": "2019"}], "name": "Thurey,Nils", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "1", "target": "4"}, {"source": "1", "target": "5"}, {"source": "2", "target": "3"}, {"source": "3", "target": "4"}, {"source": "3", "target": "5"}], "year": 2019, "authorId": {"0": "Thurey,Nils", "1": "Kugelstadt,Tassilo", "2": "Longva,Andreas", "3": "Bender,Jan", "4": "Koschier,Dan", "5": "Weiler,Marcel"}}