{"edges": [[0, 1], [0, 2], [1, 0], [1, 2], [2, 0], [2, 1]], "features": {"0": "0", "1": "1", "2": "2"}, "count": 1, "cite": 0, "position": 1.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.3333333333333333, "totalCite": 0.0, "totalPosition": 3.0, "paper": [{"title": "Empirical Comparison of Curvature Estimators on Volume Images and Triangle Meshes", "author": ["Kronenberger,Markus", "Wirjadi,Oliver", "Hagen,Hans"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2861007", "keywords": "", "abstract": "In the development of graphical algorithms, choosing an appropriate data representation plays a pivotal role. Hence, there is a need for studies that support corresponding decision making. Here, we investigate curvature estimation based on two discrete representations-volume images and triangle meshes-and present a comprehensive cross-comparison. For doing so, four carefully selected geometries, represented as implicit functions, have been discretized to volume images and triangle meshes in different resolutions on a comparable scale. Afterwards, implementations available in open-source libraries (CGAL, DIPimage, libigl, trimesh2, VTK) and our own implementation of a relevant paper [1] were applied to them and the resulting estimations of mean and Gaussian curvature were compared in terms of quality and runtime. Independent of the underlying discrete representation, all estimators generated similar errors, but overall, mesh-based methods allowed for more accurate estimations. We measured a maximum normalized mean absolute error difference of 6.36 percent between the most precise mesh-based method compared to corresponding image-based methods when considering only discretizations of sufficient resolution. In terms of runtime, methods working on triangle meshes were faster when geometries had a small surface density. For geometries with larger surface densities, which is fairly common when considering real data, e.g., in material or medical science, the runtimes for both representations were similar.", "cite": 0, "year": "2019"}], "name": "Kronenberger,Markus", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "2"}], "year": 2019, "authorId": {"0": "Kronenberger,Markus", "1": "Wirjadi,Oliver", "2": "Hagen,Hans"}}