{"edges": [[0, 1], [0, 2], [0, 3], [0, 4], [1, 2], [1, 0], [1, 3], [1, 4], [2, 1], [2, 0], [2, 3], [2, 4], [3, 1], [3, 2], [3, 0], [3, 4], [4, 1], [4, 2], [4, 0], [4, 3]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4"}, "count": 1, "cite": 2, "position": 3.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.2, "totalCite": 2.0, "totalPosition": 5.0, "paper": [{"title": "Towards a Quantitative Survey of Dimension Reduction Techniques.", "author": ["Espadoto,Mateus", "Martins,RafaelM", "Kerren,Andreas", "Hirata,NinaST", "Telea,AlexandruCristian"], "soname": "IEEE transactions on visualization and computer graphics", "DOI": "10.1109/TVCG.2019.2944182", "keywords": "", "abstract": "Dimensionality reduction methods, also known as projections, are frequently used in multidimensional data exploration in machine learning, data science, and information visualization. Tens of such techniques have been proposed, aiming to address a wide set of requirements, such as ability to show the high-dimensional data structure, distance or neighborhood preservation, computational scalability, stability to data noise and/or outliers, and practical ease of use. However, it is far from clear for practitioners how to choose the best technique for a given use context. We present a survey of a wide body of projection techniques that helps answering this question. For this, we characterize the input data space, projection techniques, and the quality of projections, by several quantitative metrics. We sample these three spaces according to these metrics, aiming at good coverage with bounded effort. We describe our measurements and outline observed dependencies of the measured variables. Based on these results, we draw several conclusions that help comparing projection techniques, explain their results for different types of data, and ultimately help practitioners when choosing a projection for a given context. Our methodology, datasets, projection implementations, metrics, visualizations, and results are publicly open, so interested stakeholders can examine and/or extend this benchmark.", "cite": 2, "year": "2019"}], "name": "Kerren,Andreas", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "0", "target": "4"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "1", "target": "4"}, {"source": "2", "target": "3"}, {"source": "2", "target": "4"}, {"source": "3", "target": "4"}], "year": 2019, "authorId": {"0": "Kerren,Andreas", "1": "Espadoto,Mateus", "2": "Martins,RafaelM", "3": "Hirata,NinaST", "4": "Telea,AlexandruCristian"}}