{"edges": [[0, 1], [0, 2], [0, 3], [1, 2], [1, 0], [1, 3], [2, 1], [2, 0], [2, 3], [3, 1], [3, 2], [3, 0], [3, 4]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4"}, "count": 1, "cite": 0, "position": 3.0, "connect": 1.0, "totalConnect": 1.8571428571428572, "totalCount": 0.6, "totalCite": 1.0, "totalPosition": 3.0, "paper": [{"title": "MineTime Insight: Visualizing Meeting Habits to Promote Informed Scheduling Decisions.", "author": ["Ancona,Marco", "Beyeler,Marilou", "Gross,Markus", "Guenther,Tobias"], "soname": "IEEE transactions on visualization and computer graphics", "DOI": "10.1109/TVCG.2019.2941208", "keywords": "", "abstract": "Corporate meetings are a crucial part of business activities. While numerous academic papers investigated how to make the scheduling process of meetings faster or even automatic, little work has been done yet to facilitate the retrospective reasoning about how time is spent on meetings. Traditional calendar applications do not allow users to extract actionable statistics although it has been shown that reflection-oriented design can increase the users' understanding of their habits and can thereby encourage a shift towards better practices. In this paper, we present MineTime Insight, a tool made of multiple coordinated views for the exploration of personal calendar data, with the overarching goal of improving short and long-term scheduling decisions. Despite being focused on the working environment, our work builds upon recent results in the field of Personal Visual Analytics, as it targets users not necessarily expert in visualization and data analysis. We demonstrate the potential of MineTime Insight, when applied to the agenda of an executive manager. Finally, we discuss the results of an informal user study and a field study. Our results suggest that our visual representations are perceived as easy to understand and helpful towards a change in the scheduling habits.", "cite": 0, "year": "2019"}], "name": "Gross,Markus", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "2", "target": "3"}, {"source": "3", "target": "4"}], "year": 2019, "authorId": {"0": "Gross,Markus", "1": "Ancona,Marco", "2": "Beyeler,Marilou", "3": "Guenther,Tobias", "4": "Theisel,Holger"}}