{"edges": [[0, 1], [0, 2], [0, 3], [0, 4], [0, 5], [0, 6], [0, 7], [0, 8], [0, 9], [0, 10], [1, 2], [1, 0], [2, 1], [2, 0], [3, 4], [3, 5], [3, 0], [3, 6], [4, 3], [4, 5], [4, 0], [4, 6], [5, 3], [5, 4], [5, 0], [5, 6], [6, 3], [6, 4], [6, 5], [6, 0], [7, 0], [8, 9], [8, 10], [8, 0], [9, 8], [9, 10], [9, 0], [10, 11], [10, 12], [10, 13], [10, 14], [10, 8], [10, 9], [10, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7", "8": "8", "9": "9", "10": "10", "11": "11", "12": "12", "13": "13", "14": "14"}, "count": 4, "cite": 9, "position": 3.25, "connect": 1.0, "totalConnect": 1.8333333333333333, "totalCount": 0.3333333333333333, "totalCite": 2.6, "totalPosition": 3.8, "paper": [{"title": "Integral Curve Clustering and Simplification for Flow Visualization: A Comparative Evaluation.", "author": ["Shi,Lieyu", "SLaramee,Robert", "Chen,Guoning"], "soname": "IEEE transactions on visualization and computer graphics", "DOI": "10.1109/TVCG.2019.2940935", "keywords": "", "abstract": "Unsupervised clustering techniques have been widely applied to flow simulation data to alleviate clutter and occlusion in theresulting visualization. However, there is an absence of systematic guidelines for users to evaluate (both quantitatively and visually) theappropriate clustering technique and similarity measures for streamline and pathline curves. In this work, we provide an overview of anumber of prevailing curve clustering techniques. We then perform a comprehensive experimental study to qualitatively and quantitativelycompare these clustering techniques coupled with popular similarity measures used in the flow visualization literature. Based on ourexperimental results, we derive empirical guidelines for selecting the appropriate clustering technique and similarity measure given therequirements of the visualization task. We believe our work will inform the task of generating meaningful reduced representations forlarge-scale flow data and inspire the continuous investigation of a more refined guidance on clustering technique selection.", "cite": 1, "year": "2019"}, {"title": "Robust Tracing and Visualization of Heterogeneous Microvascular Networks", "author": ["Govyadinov,PavelA.", "Womack,Tasha", "Eriksen,JasonL.", "Chen,Guoning", "Mayerich,David"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2818701", "keywords": "", "abstract": "Advances in high-throughput imaging allow researchers to collect three-dimensional images of whole organ microvascular networks. These extremely large images contain networks that are highly complex, time consuming to segment, and difficult to visualize. In this paper, we present a framework for segmenting and visualizing vascular networks from terabyte-sized three-dimensional images collected using high-throughput microscopy. While these images require terabytes of storage, the volume devoted to the fiber network is approximate to 4 percent of the total volume size. While the networks themselves are sparse, they are tremendously complex, interconnected, and vary widely in diameter. We describe a parallel GPU-based predictor-corrector method for tracing filaments that is robust to noise and sampling errors common in these data sets. We also propose a number of visualization techniques designed to convey the complex statistical descriptions of fibers across large tissue sections-including commonly studied microvascular characteristics, such as orientation and volume.", "cite": 2, "year": "2019"}, {"title": "Hexahedral Mesh Structure Visualization and Evaluation", "author": ["Xu,Kaoji", "Chen,Guoning"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864827", "keywords": "", "abstract": "Understanding hexahedral (hex-) mesh structures is important for a number of hex-mesh generation and optimization tasks. However, due to various configurations of the singularities in a valid pure hex-mesh, the structure (or base complex) of the mesh can be arbitrarily complex. In this work, we present a first and effective method to help meshing practitioners understand the possible configurations in a valid 3D base complex for the characterization of their complexity. In particular, we propose a strategy to decompose the complex hex-mesh structure into multi-level sub-structures so that they can be studied separately, from which we identify a small set of the sub-structures that can most efficiently represent the whole mesh structure. Furthermore, from this set of sub-structures, we attempt to define the first metric for the quantification of the complexity of hex-mesh structure. To aid the exploration of the extracted multi-level structure information, we devise a visual exploration system coupled with a matrix view to help alleviate the common challenge of 3D data exploration (e.g., clutter and occlusion). We have applied our tool and metric to a large number of hex-meshes generated with different approaches to reveal different characteristics of these methods in terms of the mesh structures they can produce. We also use our metric to assess the existing structure simplification techniques in terms of their effectiveness.", "cite": 2, "year": "2019"}, {"title": "Visual Analysis of Spatio-temporal Relations of Pairwise Attributes in Unsteady Flow", "author": ["Berenjkoub,Marzieh", "Monico,RodolfoOstilla", "Laramee,RobertS.", "Chen,Guoning"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864817", "keywords": "", "abstract": "Despite significant advances in the analysis and visualization of unsteady flow, the interpretation of it's behavior still remains a challenge. In this work, we focus on the linear correlation and non-linear dependency of different physical attributes of unsteady flows to aid their study from a new perspective. Specifically, we extend the existing spatial correlation quantification, i.e. the Local Correlation Coefficient (LCC), to the spatio-temporal domain to study the correlation of attribute-pairs from both the Eulerian and Lagrangian views. To study the dependency among attributes, which need not be linear, we extend and compute the mutual information (MI) among attributes over time. To help visualize and interpret the derived correlation and dependency among attributes associated with a particle, we encode the correlation and dependency values on individual pathlines. Finally, to utilize the correlation and MI computation results to identify regions with interesting flow behavior, we propose a segmentation strategy of the flow domain based on the ranking of the strength of the attributes relations. We have applied our correlation and dependency metrics to a number of 2D and 3D unsteady flows with varying spatio-temporal kernel sizes to demonstrate and assess their effectiveness.", "cite": 4, "year": "2019"}], "name": "Chen,Guoning", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}, {"id": "7"}, {"id": "8"}, {"id": "9"}, {"id": "10"}, {"id": "11"}, {"id": "12"}, {"id": "13"}, {"id": "14"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "0", "target": "4"}, {"source": "0", "target": "5"}, {"source": "0", "target": "6"}, {"source": "0", "target": "7"}, {"source": "0", "target": "8"}, {"source": "0", "target": "9"}, {"source": "0", "target": "10"}, {"source": "1", "target": "2"}, {"source": "3", "target": "4"}, {"source": "3", "target": "5"}, {"source": "3", "target": "6"}, {"source": "4", "target": "5"}, {"source": "4", "target": "6"}, {"source": "5", "target": "6"}, {"source": "8", "target": "9"}, {"source": "8", "target": "10"}, {"source": "9", "target": "10"}, {"source": "10", "target": "11"}, {"source": "10", "target": "12"}, {"source": "10", "target": "13"}, {"source": "10", "target": "14"}], "year": 2019, "authorId": {"0": "Chen,Guoning", "1": "Shi,Lieyu", "2": "SLaramee,Robert", "3": "Govyadinov,PavelA.", "4": "Womack,Tasha", "5": "Eriksen,JasonL.", "6": "Mayerich,David", "7": "Xu,Kaoji", "8": "Berenjkoub,Marzieh", "9": "Monico,RodolfoOstilla", "10": "Laramee,RobertS.", "11": "Roberts,RichardC.", "12": "Smith,GaryA.", "13": "Brookes,Paul", "14": "D'Cruze,Tony"}}