{"edges": [[0, 1], [0, 2], [1, 0], [1, 2], [1, 3], [1, 4], [2, 1], [2, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4"}, "count": 1, "cite": 0, "position": 2.0, "connect": 1.0, "totalConnect": 1.6, "totalCount": 0.6, "totalCite": 2.6666666666666665, "totalPosition": 4.0, "paper": [{"title": "Continuous-Scale Kinetic Fluid Simulation", "author": ["Li,Wei", "Bai,Kai", "Liu,Xiaopei"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2859931", "keywords": "", "abstract": "Kinetic approaches, i.e., methods based on the lattice Boltzmann equations, have long been recognized as an appealing alternative for solving incompressible Navier-Stokes equations in computational fluid dynamics. However, such approaches have not been widely adopted in graphics mainly due to the underlying inaccuracy, instability and inflexibility. In this paper, we try to tackle these problems in order to make kinetic approaches practical for graphical applications. To achieve more accurate and stable simulations, we propose to employ the non-orthogonal central-moment-relaxation model, where we develop a novel adaptive relaxation method to retain both stability and accuracy in turbulent flows. To achieve flexibility, we propose a novel continuous-scale formulation that enables samples at arbitrary resolutions to easily communicate with each other in a more continuous sense and with loose geometrical constraints, which allows efficient and adaptive sample construction to better match the physical scale. Such a capability directly leads to an automatic sample construction which generates static and dynamic scales at initialization and during simulation, respectively. This effectively makes our method suitable for simulating turbulent flows with arbitrary geometrical boundaries. Our simulation results with applications to smoke animations show the benefits of our method, with comparisons for justification and verification.", "cite": 0, "year": "2019"}], "name": "Bai,Kai", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "1", "target": "4"}], "year": 2019, "authorId": {"0": "Bai,Kai", "1": "Li,Wei", "2": "Liu,Xiaopei", "3": "Gong,Huajun", "4": "Yang,Ruigang"}}