{"edges": [[0, 1], [0, 2], [1, 0], [1, 2], [2, 1], [2, 0]], "features": {"0": "0", "1": "1", "2": "2"}, "count": 1, "cite": 0, "position": 2.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.3333333333333333, "totalCite": 0.0, "totalPosition": 3.0, "paper": [{"title": "Gaze-Driven Adaptive Interventions for Magazine-Style Narrative Visualizations.", "author": ["Lalle,Sebastien", "Toker,Dereck", "Conati,Cristina"], "soname": "IEEE transactions on visualization and computer graphics", "DOI": "10.1109/TVCG.2019.2958540", "keywords": "", "abstract": "In this paper we investigate the value of gaze-driven adaptive interventions to support processing of textual documents with embedded visualizations, i.e., Magazine Style Narrative Visualizations (MSNVs). These interventions are provided dynamically by highlighting relevant data points in the visualization when the user reads related sentences in the MNSV text, as detected by an eye-tracker. We conducted a user study during which participants read a set of MSNVs with our interventions, and compared their performance and experience with participants who received no interventions. Our work extends previous findings by showing that dynamic, gaze-driven interventions can be delivered based on reading behaviors in MSNVs, a widespread form of documents that have never been considered for gaze-driven adaptation so far. Next, we found that the interventions significantly improved the performance of users with low levels of visualization literacy, i.e., those users who need help the most due to their lower ability to process and understand data visualizations. However, high literacy users were not impacted by the interventions, providing initial evidence that gaze-driven interventions can be further improved by personalizing them to the levels of visualization literacy of their users.", "cite": 0, "year": "2019"}], "name": "Toker,Dereck", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "2"}], "year": 2019, "authorId": {"0": "Toker,Dereck", "1": "Lalle,Sebastien", "2": "Conati,Cristina"}}