{"edges": [[0, 1], [0, 2], [0, 3], [1, 2], [1, 3], [1, 0], [2, 1], [2, 3], [2, 0], [3, 1], [3, 2], [3, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3"}, "count": 1, "cite": 4, "position": 4.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.25, "totalCite": 4.0, "totalPosition": 4.0, "paper": [{"title": "HapTable: An Interactive Tabletop Providing Online Haptic Feedback for Touch Gestures", "author": ["Emgin,SenemEzgi", "Aghakhani,Amirreza", "Sezgin,T.Metin", "Basdogan,Cagatay"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2855154", "keywords": "", "abstract": "We present HapTable; a multi-modal interactive tabletop that allows users to interact with digital images and objects through natural touch gestures, and receive visual and haptic feedback accordingly. In our system, hand pose is registered by an infrared camera and hand gestures are classified using a Support Vector Machine (SVM) classifier. To display a rich set of haptic effects for both static and dynamic gestures, we integrated electromechanical and electrostatic actuation techniques effectively on tabletop surface of HapTable, which is a surface capacitive touch screen. We attached four piezo patches to the edges of tabletop to display vibrotactile feedback for static gestures. For this purpose, the vibration response of the tabletop, in the form of frequency response functions (FRFs), was obtained by a laser Doppler vibrometer for 84 grid points on its surface. Using these FRFs, it is possible to display localized vibrotactile feedback on the surface for static gestures. For dynamic gestures, we utilize the electrostatic actuation technique to modulate the frictional forces between finger skin and tabletop surface by applying voltage to its conductive layer. To our knowledge, this hybrid haptic technology is one of a kind and has not been implemented or tested on a tabletop. It opens up new avenues for gesture-based haptic interaction not only on tabletop surfaces but also on touch surfaces used in mobile devices with potential applications in data visualization, user interfaces, games, entertainment, and education. Here, we present two examples of such applications, one for static and one for dynamic gestures, along with detailed user studies. In the first one, user detects the direction of a virtual flow, such as that of wind or water, by putting their hand on the tabletop surface and feeling a vibrotactile stimulus traveling underneath it. In the second example, user rotates a virtual knob on the tabletop surface to select an item from a menu while feeling the knob's detents and resistance to rotation in the form of frictional haptic feedback.", "cite": 4, "year": "2019"}], "name": "Basdogan,Cagatay", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "2", "target": "3"}], "year": 2019, "authorId": {"0": "Basdogan,Cagatay", "1": "Emgin,SenemEzgi", "2": "Aghakhani,Amirreza", "3": "Sezgin,T.Metin"}}