{"edges": [[0, 1], [1, 2], [1, 3], [1, 4], [1, 5], [1, 6], [1, 7], [1, 8], [1, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7", "8": "8"}, "count": 1, "cite": 2, "position": 1.0, "connect": 1.0, "totalConnect": 1.125, "totalCount": 1.0, "totalCite": 2.3333333333333335, "totalPosition": 5.0, "paper": [{"title": "Preserving Command Line Workflow for a Package Management System Using ASCII DAG Visualization", "author": ["Isaacs,KatherineE.", "Gamblin,Todd"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2859974", "keywords": "", "abstract": "Package managers provide ease of access to applications by removing the time-consuming and sometimes completely prohibitive barrier of successfully building, installing, and maintaining the software for a system. A package dependency contains dependencies between all packages required to build and run the target software. Package management system developers, package maintainers, and users may consult the dependency graph when a simple listing is insufficient for their analyses. However, users working in a remote command line environment must disrupt their workflow to visualize dependency graphs in graphical programs, possibly needing to move files between devices or incur forwarding lag. Such is the case for users of Spack, an open source package management system originally developed to ease the complex builds required by supercomputing environments. To preserve the command line workflow of Spack, we develop an interactive ASCII visualization for its dependency graphs. Through interviews with Spack maintainers, we identify user goals and corresponding visual tasks for dependency graphs. We evaluate the use of our visualization through a command line-centered study, comparing it to the system's two existing approaches. We observe that despite the limitations of the ASCII representation, our visualization is preferred by participants when approached from a command line interface workflow.", "cite": 2, "year": "2019"}], "name": "Isaacs,KatherineE.", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}, {"id": "7"}, {"id": "8"}], "edgess": [{"source": "0", "target": "1"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "1", "target": "4"}, {"source": "1", "target": "5"}, {"source": "1", "target": "6"}, {"source": "1", "target": "7"}, {"source": "1", "target": "8"}], "year": 2019, "authorId": {"0": "Isaacs,KatherineE.", "1": "Gamblin,Todd", "2": "Nguyen,HuuTanPham", "3": "Bhatele,Abhinav", "4": "Jain,Nikhil", "5": "Kesavan,Suraj", "6": "Bhatia,Harsh", "7": "Ma,Kwan-Liu", "8": "Bremer,Peer-Timo"}}