{"edges": [[0, 1], [0, 2], [1, 2], [1, 0], [2, 1], [2, 0]], "features": {"0": "0", "1": "1", "2": "2"}, "count": 1, "cite": 1, "position": 3.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.3333333333333333, "totalCite": 1.0, "totalPosition": 3.0, "paper": [{"title": "VR Disability Simulation Reduces Implicit Bias Towards Persons with Disabilities.", "author": ["Chowdhury,TanvirIrfan", "ShahnewazFerdous,SharifMohammad", "Quarles,John"], "soname": "IEEE transactions on visualization and computer graphics", "DOI": "10.1109/TVCG.2019.2958332", "keywords": "", "abstract": "This paper investigates how experiencing Virtual Reality (VR) Disability Simulation (DS) affects information recall and participants' implicit association towards people with disabilities (PwD). Implicit attitudes are our actions or judgments towards various concepts or stereotypes (e.g., race) which we may or may not be aware of. Previous research has shown that experiencing ownership over a dark-skinned body reduces implicit racial bias. We hypothesized that a DS with a tracked Head Mounted Display (HMD) and a wheelchair interface would have a significantly larger effect on participants' information recall and their implicit association towards PwD than a desktop monitor and gamepad. We conducted a 2x2 between-subjects experiment in which participants experienced a VR DS that teaches them facts about Multiple Sclerosis (MS) with factors of display (HMD, a desktop monitor) and interface (gamepad, wheelchair). Participants took two Implicit Association Tests (IAT) before and after experiencing the DS. Our study results show that the participants in an immersive HMD condition performed better than the participants in the non-immersive Desktop condition in their information recall task. Moreover, a tracked HMD and a wheelchair interface had significantly larger effects on participants' implicit association towards PwD than a desktop monitor and a gamepad.", "cite": 1, "year": "2019"}], "name": "Quarles,John", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "2"}], "year": 2019, "authorId": {"0": "Quarles,John", "1": "Chowdhury,TanvirIrfan", "2": "ShahnewazFerdous,SharifMohammad"}}