{"edges": [[0, 1], [0, 2], [0, 3], [0, 4], [0, 5], [1, 0], [1, 2], [1, 3], [2, 0], [2, 1], [2, 3], [2, 6], [2, 7], [2, 8], [2, 9], [2, 10], [3, 0], [3, 1], [3, 2], [4, 5], [4, 0], [5, 4], [5, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7", "8": "8", "9": "9", "10": "10"}, "count": 2, "cite": 3, "position": 2.0, "connect": 1.0, "totalConnect": 1.6428571428571428, "totalCount": 0.36363636363636365, "totalCite": 3.25, "totalPosition": 5.5, "paper": [{"title": "A Model of Spatial Directness in Interactive Visualization", "author": ["Bruckner,Stefan", "Isenberg,Tobias", "Ropinski,Timo", "Wiebel,Alexander"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2848906", "keywords": "", "abstract": "We discuss the concept of directness in the context of spatial interaction with visualization. In particular, we propose a model that allows practitioners to analyze and describe the spatial directness of interaction techniques, ultimately to be able to better understand interaction issues that may affect usability. To reach these goals, we distinguish between different types of directness. Each type of directness depends on a particular mapping between different spaces, for which we consider the data space, the visualization space, the output space, the user space, the manipulation space, and the interaction space. In addition to the introduction of the model itself, we also show how to apply it to several real-world interaction scenarios in visualization, and thus discuss the resulting types of spatial directness, without recommending either more direct or more indirect interaction techniques. In particular, we will demonstrate descriptive and evaluative usage of the proposed model, and also briefly discuss its generative usage.", "cite": 2, "year": "2019"}, {"title": "Firefly: Virtual Illumination Drones for Interactive Visualization", "author": ["Stoppel,Sergej", "Erga,MagnusPaulson", "Bruckner,Stefan"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864656", "keywords": "", "abstract": "Light specification in three dimensional scenes is a complex problem and several approaches have been presented that aim to automate this process. However, there are many scenarios where a static light setup is insufficient, as the scene content and camera position may change. Simultaneous manual control over the camera and light position imposes a high cognitive load on the user. To address this challenge, we introduce a novel approach for automatic scene illumination with Fireflies. Fireflies are intelligent virtual light drones that illuminate the scene by traveling on a closed path. The Firefly path automatically adapts to changes in the scene based on an outcome-oriented energy function. To achieve interactive performance, we employ a parallel rendering pipeline for the light path evaluations. We provide a catalog of energy functions for various application scenarios and discuss the applicability of our method on several examples.", "cite": 1, "year": "2019"}], "name": "Bruckner,Stefan", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}, {"id": "7"}, {"id": "8"}, {"id": "9"}, {"id": "10"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "0", "target": "4"}, {"source": "0", "target": "5"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "2", "target": "3"}, {"source": "2", "target": "6"}, {"source": "2", "target": "7"}, {"source": "2", "target": "8"}, {"source": "2", "target": "9"}, {"source": "2", "target": "10"}, {"source": "4", "target": "5"}], "year": 2019, "authorId": {"0": "Bruckner,Stefan", "1": "Isenberg,Tobias", "2": "Ropinski,Timo", "3": "Wiebel,Alexander", "4": "Stoppel,Sergej", "5": "Erga,MagnusPaulson", "6": "Duran,David", "7": "Hermosilla,Pedro", "8": "Kozlikova,Barbora", "9": "Vinacua,Alvar", "10": "Vazquez,Pere-Pau"}}