{"edges": [[0, 1], [0, 2], [0, 3], [0, 4], [0, 5], [1, 0], [1, 2], [1, 3], [1, 4], [1, 5], [2, 1], [2, 0], [2, 3], [2, 4], [2, 5], [3, 1], [3, 0], [3, 2], [3, 4], [3, 5], [4, 1], [4, 0], [4, 2], [4, 3], [4, 5], [5, 1], [5, 0], [5, 2], [5, 3], [5, 4]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5"}, "count": 1, "cite": 0, "position": 2.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.16666666666666666, "totalCite": 0.0, "totalPosition": 6.0, "paper": [{"title": "Viewpoint Assessment and Recommendation for Photographing Architectures", "author": ["He,Jingwu", "Wang,Linbo", "Zhou,Wenzhe", "Zhang,Hongjie", "Cui,Xiufen", "Guo,Yanwen"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2853751", "keywords": "", "abstract": "This paper studies the problem of how to assess the quality of photographing viewpoints and how to choose good viewpoints for taking photographs of architectures. We achieve this by learning from photographs of world famous landmarks that are available on the Internet and their viewpoint quality ranked by online user annotation. Unlike previous efforts devoted to photo quality assessment which mainly rely on 2D image features, we show in this paper combining 2D image features extracted from images with 3D geometric features computed on the 3D models can result in more reliable evaluation of viewpoint quality. Specifically, we collect a set of photographs for each of 15 world famous architectures as well as their 3D models from the Internet. Viewpoint recovery for images is carried out through an image-model registration process, after which a newly proposed viewpoint clustering strategy is exploited to validate users' viewpoint preferences when photographing landmarks. Finally, we extract a number of 2D and 3D features for each image based on multiple visual and geometric cues and perform viewpoint recommendation by learning from both 2D and 3D features using a specifically designed SVM-2K multi-view learner, achieving superior performance over using solely 2D or 3D features. We show the effectiveness of the proposed approach through extensive experiments. The experiments also demonstrate that our system can be used to recommend viewpoints for rendering textured 3D models of buildings for the use of architectural design, in addition to viewpoint evaluation of photographs and recommendation of viewpoints for photographing architectures in practice.", "cite": 0, "year": "2019"}], "name": "Wang,Linbo", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "0", "target": "4"}, {"source": "0", "target": "5"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "1", "target": "4"}, {"source": "1", "target": "5"}, {"source": "2", "target": "3"}, {"source": "2", "target": "4"}, {"source": "2", "target": "5"}, {"source": "3", "target": "4"}, {"source": "3", "target": "5"}, {"source": "4", "target": "5"}], "year": 2019, "authorId": {"0": "Wang,Linbo", "1": "He,Jingwu", "2": "Zhou,Wenzhe", "3": "Zhang,Hongjie", "4": "Cui,Xiufen", "5": "Guo,Yanwen"}}