{"edges": [[0, 1], [0, 2], [1, 0], [1, 2], [2, 3], [2, 4], [2, 5], [2, 6], [2, 7], [2, 1], [2, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7"}, "count": 1, "cite": 17, "position": 2.0, "connect": 1.0, "totalConnect": 1.375, "totalCount": 0.625, "totalCite": 3.6, "totalPosition": 5.2, "paper": [{"title": "3D Tooth Segmentation and Labeling Using Deep Convolutional Neural Networks", "author": ["Xu,Xiaojie", "Liu,Chang", "Zheng,Youyi"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2839685", "keywords": "", "abstract": "In this paper, we present a novel approach for 3D dental model segmentation via deep Convolutional Neural Networks (CNNs). Traditional geometry-based methods tend to receive undesirable results due to the complex appearance of human teeth (e.g., missing/rotten teeth, feature-less regions, crowding teeth, extra medical attachments, etc.). Furthermore, labeling of individual tooth is hardly enabled in traditional tooth segmentation methods. To address these issues, we propose to learn a generic and robust segmentation model by exploiting deep Neural Networks, namely NNs. The segmentation task is achieved by labeling each mesh face. We extract a set of geometry features as face feature representations. In the training step, the network is fed with those features, and produces a probability vector, of which each element indicates the probability a face belonging to the corresponding model part. To this end, we extensively experiment with various network structures, and eventually arrive at a 2-level hierarchical CNNs structure for tooth segmentation: one for teeth-gingiva labeling and the other for inter-teeth labeling. Further, we propose a novel boundary-aware tooth simplification method to significantly improve efficiency in the stage of feature extraction. After CNNs prediction, we do graph-based label optimization and further refine the boundary with an improved version of fuzzy clustering. The accuracy of our mesh labeling method exceeds that of the state-of-art geometry-based methods, reaching 99.06 percent measured by area which is directly applicable in orthodontic CAD systems. It is also robust to any possible foreign matters on model surface, e.g., air bubbles, dental accessories, and many more.", "cite": 17, "year": "2019"}], "name": "Liu,Chang", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}, {"id": "7"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "2"}, {"source": "2", "target": "3"}, {"source": "2", "target": "4"}, {"source": "2", "target": "5"}, {"source": "2", "target": "6"}, {"source": "2", "target": "7"}], "year": 2019, "authorId": {"0": "Liu,Chang", "1": "Xu,Xiaojie", "2": "Zheng,Youyi", "3": "Xu,Pengfei", "4": "Fu,Hongbo", "5": "Singh,Karan", "6": "Huang,Hui", "7": "Tai,Chiew-Lan"}}