{"edges": [[0, 1], [0, 2], [0, 3], [0, 4], [0, 2], [0, 5], [0, 6], [0, 7], [0, 2], [1, 0], [1, 2], [2, 8], [2, 9], [2, 10], [2, 1], [2, 0], [2, 3], [2, 0], [2, 4], [2, 5], [2, 6], [2, 7], [2, 0], [3, 0], [3, 4], [3, 2], [4, 3], [4, 0], [4, 2], [2, 8], [2, 9], [2, 10], [2, 1], [2, 0], [2, 3], [2, 0], [2, 4], [2, 5], [2, 6], [2, 7], [2, 0], [5, 6], [5, 7], [5, 2], [5, 0], [6, 5], [6, 7], [6, 2], [6, 0], [7, 5], [7, 6], [7, 2], [7, 0], [2, 8], [2, 9], [2, 10], [2, 1], [2, 0], [2, 3], [2, 0], [2, 4], [2, 5], [2, 6], [2, 7], [2, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7", "8": "8", "9": "9", "10": "10"}, "count": 3, "cite": 9, "position": 3.0, "connect": 1.2857142857142858, "totalConnect": 3.25, "totalCount": 0.36363636363636365, "totalCite": 2.25, "totalPosition": 4.0, "paper": [{"title": "A Voxel-Based Rendering Pipeline for Large 3D Line Sets", "author": ["Kanzler,Mathias", "Rautenhaus,Marc", "Westermann,Ruediger"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2834372", "keywords": "", "abstract": "We present a voxel-based rendering pipeline for large 3D line sets that employs GPU ray-casting to achieve scalable rendering including transparency and global illumination effects. Even for opaque lines we demonstrate superior rendering performance compared to GPU rasterization of lines, and when transparency is used we can interactively render amounts of lines that are infeasible to be rendered via rasterization. We propose a direction-preserving encoding of lines into a regular voxel grid, along with the quantization of directions using face-to-face connectivity in this grid. On the regular grid structure, parallel GPU ray-casting is used to determine visible fragments in correct visibility order. To enable interactive rendering of global illumination effects like low-frequency shadows and ambient occlusions, illumination simulation is performed during ray-casting on a level-of-detail (LoD) line representation that considers the number of lines and their lengths per voxel. In this way we can render effects which are very difficult to render via GPU rasterization. A detailed performance and quality evaluation compares our approach to rasterization-based rendering of lines.", "cite": 1, "year": "2019"}, {"title": "Visual Analysis of the Temporal Evolution of Ensemble Forecast Sensitivities", "author": ["Kumpf,Alexander", "Rautenhaus,Marc", "Riemer,Michael", "Westermann,Ruediger"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864901", "keywords": "", "abstract": "Ensemble sensitivity analysis (ESA) has been established in the atmospheric sciences as a correlation-based approach to determine the sensitivity of a scalar forecast quantity computed by a numerical weather prediction model to changes in another model variable at a different model state. Its applications include determining the origin of forecast errors and placing targeted observations to improve future forecasts. We a team of visualization scientists and meteorologists present a visual analysis framework to improve upon current practice of ESA. We support the user in selecting regions to compute a meaningful target forecast quantity by embedding correlation-based grid-point clustering to obtain statistically coherent regions. The evolution of sensitivity features computed via ESA are then traced through time, by integrating a quantitative measure of feature matching into optical-flow-based feature assignment, and displayed by means of a swipe-path showing the geo-spatial evolution of the sensitivities. Visualization of the internal correlation structure of computed features guides the user towards those features robustly predicting a certain weather event. We demonstrate the use of our method by application to real-world 2D and 3D cases that occurred during the 2016 NAWDEX field campaign, showing the interactive generation of hypothesis chains to explore how atmospheric processes sensitive to each other are interrelated.", "cite": 8, "year": "2019"}, {"title": "Interactive 3D Visual Analysis of Atmospheric Fronts", "author": ["Kern,Michael", "Hewson,Tim", "Schaefler,Andreas", "Westermann,Ruediger", "Rautenhaus,Marc"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864806", "keywords": "", "abstract": "Atmospheric fronts play a central role in meteorology, as the boundaries between different air masses and as fundamental features of extra-tropical cyclones. They appear in numerous conceptual model depictions of extra-tropical weather systems. Conceptually. fronts are three-dimensional surfaces in space possessing an innate structural complexity. yet in meteorology, both manual and objective identification and depiction have historically focused on the structure in two dimensions. In this work, we-a team of visualization scientists and meteorologists- propose a novel visualization approach to analyze the three-dimensional structure of atmospheric fronts and related physical and dynamical processes. We build upon existing approaches to objectively identify fronts as lines in two dimensions and extend these to obtain frontal surfaces in three dimensions, using the magnitude of temperature change along the gradient of a moist potential temperature field as the primary identifying factor. We introduce the use of normal curves in the temperature gradient field to visualize a frontal zone (i.e., the transitional zone between the air masses) and the distribution of atmospheric variables in such zones. To enable for the first time a statistical analysis of frontal zones, we present a new approach to obtain the volume enclosed by a zone, by classifying grid boxes that intersect with normal curves emanating from a selected front. We introduce our method by means of an idealized numerical simulation and demonstrate its use with two real-world cases using numerical weather prediction data.", "cite": 0, "year": "2019"}], "name": "Rautenhaus,Marc", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}, {"id": "7"}, {"id": "8"}, {"id": "9"}, {"id": "10"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "0", "target": "4"}, {"source": "0", "target": "5"}, {"source": "0", "target": "6"}, {"source": "0", "target": "7"}, {"source": "1", "target": "2"}, {"source": "2", "target": "8"}, {"source": "2", "target": "9"}, {"source": "2", "target": "10"}, {"source": "2", "target": "3"}, {"source": "2", "target": "4"}, {"source": "2", "target": "5"}, {"source": "2", "target": "6"}, {"source": "2", "target": "7"}, {"source": "3", "target": "4"}, {"source": "5", "target": "6"}, {"source": "5", "target": "7"}, {"source": "6", "target": "7"}], "year": 2019, "authorId": {"0": "Rautenhaus,Marc", "1": "Kanzler,Mathias", "2": "Westermann,Ruediger", "3": "Kumpf,Alexander", "4": "Riemer,Michael", "5": "Kern,Michael", "6": "Hewson,Tim", "7": "Schaefler,Andreas", "8": "Weiss,Sebastian", "9": "Chu,Mengyu", "10": "Thuerey,Nils"}}