{"edges": [[0, 1], [0, 2], [0, 3], [1, 2], [1, 0], [1, 3], [2, 1], [2, 0], [2, 3], [3, 1], [3, 2], [3, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3"}, "count": 1, "cite": 0, "position": 3.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.25, "totalCite": 0.0, "totalPosition": 4.0, "paper": [{"title": "Biorthogonal Wavelet Transforms and Applications Based on Generalized Progressive Catmull-Clark Subdivision with Shape Control", "author": ["Guo,Huayuan", "Guan,Youjiang", "Liu,Minchao", "Qin,Kaihuai"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2845887", "keywords": "", "abstract": "In recent years, some biorthogonal Catmull-Clark subdivision wavelet transforms constructed via the lifting scheme have been proposed to speed up processing of geometric models. Thanks to the idea of progressive interpolation, the compression qualities and noise-filtering effects have been improved significantly. However, the reconstruction precision fails to be improved further because many model details are removed and the noise-filtering performance decreases greatly while the noise intensity increases gradually. To deal with this dilemma, a unified Catmull-Clark subdivision based biorthogonal wavelet construction with shape control parameters is presented to process 3D models with sharp-feature constraints. By customizing its local orthogonalizing coefficients for different vertex valences of quadrilateral patches, the novel scheme can greatly strengthen the capability of the model's shape control that is vital for data compression, noise-filtering, etc. Combined with the local and in-place lifting operations, the proposed wavelet transform can dramatically decrease the memory consumption and computation complexity. Both theoretical analysis and numerical experiments show that, compared with the state-of-the-art lifting-based solutions, the proposed wavelet transform achieves higher compression ratio, more stable noise-filtering effects and better progressive transmission quality, not only decreasing the Bits/vertex of 3D meshes and improving the PSNR of reconstructed models, but also reducing the time costs of coding and decoding.", "cite": 0, "year": "2019"}], "name": "Liu,Minchao", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "2", "target": "3"}], "year": 2019, "authorId": {"0": "Liu,Minchao", "1": "Guo,Huayuan", "2": "Guan,Youjiang", "3": "Qin,Kaihuai"}}