{"edges": [[0, 1], [0, 2], [0, 3], [0, 4], [0, 5], [0, 6], [0, 7], [0, 8], [0, 1], [0, 9], [0, 10], [0, 11], [0, 4], [1, 2], [1, 3], [1, 0], [1, 4], [1, 9], [1, 10], [1, 11], [1, 0], [1, 4], [2, 1], [2, 3], [2, 0], [2, 4], [3, 1], [3, 2], [3, 0], [3, 4], [4, 1], [4, 2], [4, 3], [4, 0], [4, 12], [4, 13], [4, 14], [4, 1], [4, 9], [4, 10], [4, 11], [4, 0], [5, 6], [5, 0], [5, 7], [5, 8], [6, 5], [6, 0], [6, 7], [6, 8], [7, 5], [7, 6], [7, 0], [7, 8], [8, 5], [8, 6], [8, 0], [8, 7], [1, 2], [1, 3], [1, 0], [1, 4], [1, 9], [1, 10], [1, 11], [1, 0], [1, 4], [9, 1], [9, 10], [9, 11], [9, 0], [9, 4], [10, 1], [10, 9], [10, 11], [10, 0], [10, 4], [11, 1], [11, 9], [11, 10], [11, 0], [11, 4], [4, 1], [4, 2], [4, 3], [4, 0], [4, 12], [4, 13], [4, 14], [4, 1], [4, 9], [4, 10], [4, 11], [4, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7", "8": "8", "9": "9", "10": "10", "11": "11", "12": "12", "13": "13", "14": "14"}, "count": 3, "cite": 2, "position": 4.0, "connect": 1.1818181818181819, "totalConnect": 2.6857142857142855, "totalCount": 0.26666666666666666, "totalCite": 1.5, "totalPosition": 5.0, "paper": [{"title": "Classification of Blood Flow Patterns in Cerebral Aneurysms", "author": ["Meuschke,Monique", "Oeltze-Jafra,Steffen", "Beuing,Oliver", "Preim,Bernhard", "Lawonn,Kai"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2834923", "keywords": "", "abstract": "We present a Cerebral Aneurysm Vortex Classification (CAVOCLA) that allows to classify blood flow in cerebral aneurysms. Medical studies assume a strong relation between the progression and rupture of aneurysms and flow patterns. To understand how flow patterns impact the vessel morphology, they are manually classified according to predefined classes. However, manual classifications are time-consuming and exhibit a high inter-observer variability. In contrast, our approach is more objective and faster than manual methods. The classification of integral lines, representing steady or unsteady blood flow, is based on a mapping of the aneurysm surface to a hemisphere by calculating polar-based coordinates. The lines are clustered and for each cluster a representative is calculated. Then, the polar-based coordinates are transformed to the representative as basis for the classification. Classes are based on the flow complexity. The classification results are presented by a detail-on-demand approach using a visual transition from the representative over an enclosing surface to the associated lines. Based on seven representative datasets, we conduct an informal interview with five domain experts to evaluate the system. They confirmed that CAVOCLA allows for a robust classification of intra-aneurysmal flow patterns. The detail-on-demand visualization enables an efficient exploration and interpretation of flow patterns.", "cite": 0, "year": "2019"}, {"title": "Popup-Plots: Warping Temporal Data Visualization", "author": ["Schmidt,Johanna", "Fleischmann,Dominik", "Preim,Bernhard", "Braendle,Norbert", "Mistelbauer,Gabriel"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2841385", "keywords": "", "abstract": "Temporal data visualization is used to analyze dependent variables that vary over time, with time being an independent variable. Visualizing temporal data is inherently difficult, due to the many aspects that need to be communicated to the users (e.g., time and variable changes). This is an important topic in visualization, and a wide range of visualization techniques dealing with different tasks have already been designed. In this paper we propose popup-plots, a novel concept where the common interaction of 3D rotation is used to navigate through the data. This allows the users to view the data from different perspectives without having to learn and adapt to new interaction concepts. Popup-plots are therefore a novel method for visualizing and interacting with dependent variables over time. We extend 2D plots with the temporal information by bending the space according to the time. The bending is calculated based on a spherical coordinates approach, which is continuously influenced by the viewing direction towards the plot. Hence, the plot can be viewed from various angles with seamless transitions in between, offering the possibility to analyze different aspects of the represented data. As the current viewing direction is inherently depicted by the shape of the data, the users are able to deduce which part of the data is currently viewed. The temporal information is encoded into the visualization itself, resembling annual rings of a tree. We demonstrate our method by applying it to data from two different domains, comprising measurements at spatial positions over time, and we also evaluated the usability of our solution.", "cite": 0, "year": "2019"}, {"title": "Visual Analysis of Aneurysm Data using Statistical Graphics", "author": ["Meuschke,Monique", "Gunther,Tobias", "Berg,Philipp", "Wickenhoefer,Ralph", "Preim,Bernhard", "Lawonn,Kai"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864509", "keywords": "", "abstract": "This paper presents a framework to explore multi-field data of aneurysms occurring at intracranial and cardiac arteries by using statistical graphics. The rupture of an aneurysm is often a fatal scenario, whereas during treatment serious complications for the patient can occur. Whether an aneurysm ruptures or whether a treatment is successful depends on the interaction of different morphological such as wall deformation and thickness, and hemodynamic attributes like wall shear stress and pressure. Therefore, medical researchers are very interested in better understanding these relationships. However, the required analysis is a time-consuming process, where suspicious wall regions are difficult to detect due to the time-dependent behavior of the data. Our proposed visualization framework enables medical researchers to efficiently assess aneurysm risk and treatment options. This comprises a powerful set of views including 2D and 3D depictions of the aneurysm morphology as well as statistical plots of different scalar fields. Brushing and linking aids the user to identify interesting wall regions and to understand the influence of different attributes on the aneurysm's state. Moreover, a visual comparison of pre- and post-treatment as well as different treatment options is provided. Our analysis techniques are designed in collaboration with domain experts, e.g., physicians, and we provide details about the evaluation.", "cite": 2, "year": "2019"}], "name": "Preim,Bernhard", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}, {"id": "7"}, {"id": "8"}, {"id": "9"}, {"id": "10"}, {"id": "11"}, {"id": "12"}, {"id": "13"}, {"id": "14"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "0", "target": "4"}, {"source": "0", "target": "5"}, {"source": "0", "target": "6"}, {"source": "0", "target": "7"}, {"source": "0", "target": "8"}, {"source": "0", "target": "9"}, {"source": "0", "target": "10"}, {"source": "0", "target": "11"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "1", "target": "4"}, {"source": "1", "target": "9"}, {"source": "1", "target": "10"}, {"source": "1", "target": "11"}, {"source": "2", "target": "3"}, {"source": "2", "target": "4"}, {"source": "3", "target": "4"}, {"source": "4", "target": "12"}, {"source": "4", "target": "13"}, {"source": "4", "target": "14"}, {"source": "4", "target": "9"}, {"source": "4", "target": "10"}, {"source": "4", "target": "11"}, {"source": "5", "target": "6"}, {"source": "5", "target": "7"}, {"source": "5", "target": "8"}, {"source": "6", "target": "7"}, {"source": "6", "target": "8"}, {"source": "7", "target": "8"}, {"source": "9", "target": "10"}, {"source": "9", "target": "11"}, {"source": "10", "target": "11"}], "year": 2019, "authorId": {"0": "Preim,Bernhard", "1": "Meuschke,Monique", "2": "Oeltze-Jafra,Steffen", "3": "Beuing,Oliver", "4": "Lawonn,Kai", "5": "Schmidt,Johanna", "6": "Fleischmann,Dominik", "7": "Braendle,Norbert", "8": "Mistelbauer,Gabriel", "9": "Gunther,Tobias", "10": "Berg,Philipp", "11": "Wickenhoefer,Ralph", "12": "Heinrich,Florian", "13": "Joeres,Fabian", "14": "Hansen,Christian"}}