{"edges": [[0, 1], [0, 2], [0, 3], [1, 2], [1, 0], [1, 4], [1, 2], [1, 5], [2, 1], [2, 0], [2, 6], [2, 7], [2, 8], [2, 9], [2, 10], [2, 11], [2, 12], [2, 13], [2, 11], [2, 4], [2, 1], [2, 5], [3, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7", "8": "8", "9": "9", "10": "10", "11": "11", "12": "12", "13": "13"}, "count": 2, "cite": 18, "position": 2.5, "connect": 1.0, "totalConnect": 1.4375, "totalCount": 0.42857142857142855, "totalCite": 6.666666666666667, "totalPosition": 4.333333333333333, "paper": [{"title": "Task-Based Effectiveness of Basic Visualizations", "author": ["Saket,Bahador", "Endert,Alex", "Demiralp,Cagatay"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2829750", "keywords": "", "abstract": "Visualizations of tabular data are widely used; understanding their effectiveness in different task and data contexts is fundamental to scaling their impact. However, little is known about how basic tabular data visualizations perform across varying data analysis tasks. In this paper, we report results from a crowdsourced experiment to evaluate the effectiveness of five small scale (5-34 data points) two-dimensional visualization types-Table, Line Chart, Bar Chart, Scatterplot, and Pie Chart-across ten common data analysis tasks using two datasets. We find the effectiveness of these visualization types significantly varies across task, suggesting that visualization design would benefit from considering context-dependent effectiveness. Based on our findings, we derive recommendations on which visualizations to choose based on different tasks. We finally train a decision tree on the data we collected to drive a recommender, showcasing how to effectively engineer experimental user data into practical visualization systems.", "cite": 7, "year": "2019"}, {"title": "Clustrophile 2: Guided Visual Clustering Analysis", "author": ["Cavallo,Marco", "Demiralp,Cagatay"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864477", "keywords": "", "abstract": "Data clustering is a common unsupervised learning method frequently used in exploratory data analysis. However, identifying relevant structures in unlabeled, high-dimensional data is nontrivial. requiring iterative experimentation with clustering parameters as well as data features and instances. The number of possible clusterings for a typical dataset is vast, and navigating in this vast space is also challenging. The absence of ground-truth labels makes it impossible to define an optimal solution, thus requiring user judgment to establish what can be considered a satisfiable clustering result. Data scientists need adequate interactive tools to effectively explore and navigate the large clustering space so as to improve the effectiveness of exploratory clustering analysis. We introduce Clustrophile 2, a new interactive tool for guided clustering analysis. Clustrophile 2 guides users in clustering-based exploratory analysis, adapts user feedback to improve user guidance, facilitates the interpretation of clusters, and helps quickly reason about differences between clusterings. To this end, Clustrophile 2 contributes a novel feature, the Clustering Tour, to help users choose clustering parameters and assess the quality of different clustering results in relation to current analysis goals and user expectations. We evaluate Clustrophile 2 through a user study with 12 data scientists, who used our tool to explore and interpret sub-cohorts in a dataset of Parkinson's disease patients. Results suggest that Clustrophile 2 improves the speed and effectiveness of exploratory clustering analysis for both experts and non-experts.", "cite": 11, "year": "2019"}], "name": "Demiralp,Cagatay", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}, {"id": "7"}, {"id": "8"}, {"id": "9"}, {"id": "10"}, {"id": "11"}, {"id": "12"}, {"id": "13"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "1", "target": "2"}, {"source": "1", "target": "4"}, {"source": "1", "target": "5"}, {"source": "2", "target": "6"}, {"source": "2", "target": "7"}, {"source": "2", "target": "8"}, {"source": "2", "target": "9"}, {"source": "2", "target": "10"}, {"source": "2", "target": "11"}, {"source": "2", "target": "12"}, {"source": "2", "target": "13"}, {"source": "2", "target": "4"}, {"source": "2", "target": "5"}], "year": 2019, "authorId": {"0": "Demiralp,Cagatay", "1": "Saket,Bahador", "2": "Endert,Alex", "3": "Cavallo,Marco", "4": "Sarvghad,Ali", "5": "Weibel,Nadir", "6": "Wall,Emily", "7": "Agnihotri,Meeshu", "8": "Matzen,Laura", "9": "Divis,Kristin", "10": "Haass,Michael", "11": "Stasko,John", "12": "Srinivasan,Arjun", "13": "Drucker,StevenM."}}