{"edges": [[0, 1], [0, 2], [1, 0], [1, 2], [2, 0], [2, 1]], "features": {"0": "0", "1": "1", "2": "2"}, "count": 1, "cite": 1, "position": 1.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.3333333333333333, "totalCite": 1.0, "totalPosition": 3.0, "paper": [{"title": "Relaxing Dense Scatter Plots with Pixel-Based Mappings", "author": ["Raidou,RenataG.", "Groeller,M.Eduard", "Eisemann,Martin"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2019.2903956", "keywords": "", "abstract": "Scatter plots are the most commonly employed technique for the visualization of bivariate data. Despite their versatility and expressiveness in showing data aspects, such as clusters, correlations, and outliers, scatter plots face a main problem. For large and dense data, the representation suffers from clutter due to overplotting. This is often partially solved with the use of density plots. Yet, data overlap may occur in certain regions of a scatter or density plot, while other regions may be partially, or even completely empty. Adequate pixel-based techniques can be employed for effectively filling the plotting space, giving an additional notion of the numerosity of data motifs or clusters. We propose the Pixel-Relaxed Scatter Plots, a new and simple variant, to improve the display of dense scatter plots, using pixel-based, space-filling mappings. Our Pixel-Relaxed Scatter Plots make better use of the plotting canvas, while avoiding data overplotting, and optimizing space coverage and insight in the presence and size of data motifs. We have employed different methods to map scatter plot points to pixels and to visually present this mapping. We demonstrate our approach on several synthetic and realistic datasets, and we discuss the suitability of our technique for different tasks. Our conducted user evaluation shows that our Pixel-Relaxed Scatter Plots can be a useful enhancement to traditional scatter plots.", "cite": 1, "year": "2019"}], "name": "Raidou,RenataG.", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "2"}], "year": 2019, "authorId": {"0": "Raidou,RenataG.", "1": "Groeller,M.Eduard", "2": "Eisemann,Martin"}}