{"edges": [[0, 1], [0, 2], [1, 3], [1, 4], [1, 5], [1, 2], [1, 0], [2, 1], [2, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5"}, "count": 1, "cite": 11, "position": 3.0, "connect": 1.0, "totalConnect": 1.5, "totalCount": 0.6666666666666666, "totalCite": 3.25, "totalPosition": 6.25, "paper": [{"title": "Effects of AR Display Context Switching and Focal Distance Switching on Human Performance (vol 25, pg 2228, 2019)", "author": ["Gabbard,JosephL.", "Mehra,DivyaGupta", "Swan,J.Edward,II"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2832633", "keywords": "", "abstract": "In augmented reality (AR) environments, information is often distributed between real world and virtual contexts, and often appears at different distances from the user. Therefore, to integrate the information, users must repeatedly switch context and refocus the eyes. To focus at different distances, the user's eyes must accommodate, which when done repeatedly can cause eyestrain and degrade task performance. An experiment was conducted that examined switching context and focal distance between a real and an AR environment, using a text-based visual search task and a monocular optical see-through AR display. Both context switching and focal distance switching resulted in significantly reduced performance. In addition, repeatedly performing the task caused visual fatigue to steadily increase. Performance was particularly poor for virtual text presented at optical infinity, and for target letters that participants tried to read before their eyes had completely accommodated to a new focal distance. The results show that context switching and focal distance switching are important AR user interface design issues.", "cite": 11, "year": "2019"}], "name": "Swan,J.Edward,II", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "3"}, {"source": "1", "target": "4"}, {"source": "1", "target": "5"}, {"source": "1", "target": "2"}], "year": 2019, "authorId": {"0": "Swan,J.Edward,II", "1": "Gabbard,JosephL.", "2": "Mehra,DivyaGupta", "3": "Grubert,Jens", "4": "Hu,Shimin", "5": "Zollmann,Stefanie"}}