{"edges": [[0, 1], [0, 2], [0, 3], [1, 0], [1, 2], [1, 3], [2, 0], [2, 1], [2, 3], [3, 0], [3, 1], [3, 2]], "features": {"0": "0", "1": "1", "2": "2", "3": "3"}, "count": 1, "cite": 1, "position": 1.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.25, "totalCite": 1.0, "totalPosition": 4.0, "paper": [{"title": "A Quad Edge-Based Grid Encoding Model for Content-Aware Image Retargeting", "author": ["Kim,YoonHyung", "Eun,Hyunjun", "Jung,Chanho", "Kim,Changick"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2866106", "keywords": "", "abstract": "In this paper, we present a novel grid encoding model for content-aware image retargeting. In contrast to previous approaches such as vertex-based and axis-aligned grid encoding models, our approach takes each horizontal/vertical distance between two adjacent vertices as an optimization variable. Upon this difference-based encoding scheme, every vertex position of a target grid is subsequently determined after optimizing the one-dimensional values. Our quad edge-based grid model has two major advantages for image retargeting. First, the model enables a grid optimization problem to be developed in a simple quadratic program while ensuring the global convexity of objective functions. Second, due to the independency of variables, spatial regularizations can be applied in a locally adaptive manner to preserve structural components. Based on this model, we propose three quadratic objective functions. Note that, in our work, their linear combination guides a grid deformation process to obtain a visually comfortable retargeting result by preserving salient regions and structural components of an input image. Comparative evaluations have been conducted with ten existing state-of-the-art image retargeting methods, and the results show that our method built upon the quad edge-based model consistently outperforms other previous methods both on qualitative and quantitative perspectives.", "cite": 1, "year": "2019"}], "name": "Kim,YoonHyung", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "2", "target": "3"}], "year": 2019, "authorId": {"0": "Kim,YoonHyung", "1": "Eun,Hyunjun", "2": "Jung,Chanho", "3": "Kim,Changick"}}