{"edges": [[0, 1], [0, 2], [1, 0], [1, 2], [2, 1], [2, 0]], "features": {"0": "0", "1": "1", "2": "2"}, "count": 1, "cite": 5, "position": 2.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.3333333333333333, "totalCite": 5.0, "totalPosition": 3.0, "paper": [{"title": "MegaParallax: Casual 360 degrees Panoramas with Motion Parallax", "author": ["Bertel,Tobias", "Campbell,NeillD.F.", "Richardt,Christian"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2019.2898799", "keywords": "", "abstract": "The ubiquity of smart mobile devices, such as phones and tablets, enables users to casually capture 360 degrees panoramas with a single camera sweep to share and relive experiences. However. panoramas lack motion parallax as they do not provide different views for different viewpoints. The motion parallax induced by translational head motion is a crucial depth cue in daily life. Alternatives, such as omnidirectional stereo panoramas, provide different views for each eye (binocular disparity), but they also lack motion parallax as the left and right eye panoramas are stitched statically. Methods based on explicit scene geometry reconstruct textured 3D geometry, which provides motion parallax, but suffers from visible reconstruction artefacts. The core of our method is a novel multi-perspective panorama representation, which can be casually captured and rendered with motion parallax for each eye on the fly. This provides a more realistic perception of panoramic environments which is particularly useful for virtual reality applications. Our approach uses a single consumer video camera to acquire 200-400 views of a real 360 degrees environment with a single sweep. By using novel-view synthesis with flow-based blending, we show how to turn these input views into an enriched 360 degrees panoramic experience that can be explored in real time, without relying on potentially unreliable reconstruction of scene geometry. We compare our results with existing omnidirectional stereo and image-based rendering methods to demonstrate the benefit of our approach, which is the first to enable casual consumers to capture and view high-quality 360 degrees panoramas with motion parallax.", "cite": 5, "year": "2019"}], "name": "Campbell,NeillD.F.", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "2"}], "year": 2019, "authorId": {"0": "Campbell,NeillD.F.", "1": "Bertel,Tobias", "2": "Richardt,Christian"}}