{"edges": [[0, 1], [0, 2], [0, 3], [1, 0], [1, 2], [1, 3], [2, 1], [2, 0], [2, 3], [3, 1], [3, 0], [3, 2]], "features": {"0": "0", "1": "1", "2": "2", "3": "3"}, "count": 1, "cite": 2, "position": 2.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.25, "totalCite": 2.0, "totalPosition": 4.0, "paper": [{"title": "Audio-Material Reconstruction for Virtualized Reality Using a Probabilistic Damping Model", "author": ["Sterling,Auston", "Rewkowski,Nicholas", "Klatzky,RobertaL.", "Lin,MingC."], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2019.2898822", "keywords": "", "abstract": "Modal sound synthesis has been used to create realistic sounds from rigid-body objects. but requires accurate real-world material parameters. These material parameters can be estimated from recorded sounds of an impacted object, but external factors can interfere with accurate parameter estimation. We present a novel technique for estimating the damping parameters of materials from recorded impact sounds that probabilistically models these external factors. We represent the combined effects of material damping. support damping. and sampling inaccuracies with a probabilistic generative model, then use maximum likelihood estimation to fit a damping model to recorded data. This technique greatly reduces the human effort needed and does not require the precise object geometry or the exact hit location. We validate the effectiveness of this technique with a comprehensive analysis of a synthetic dataset and a perceptual study on object identification. We also present a study establishing human performance on the same parameter estimation task for comparison.", "cite": 2, "year": "2019"}], "name": "Rewkowski,Nicholas", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "2", "target": "3"}], "year": 2019, "authorId": {"0": "Rewkowski,Nicholas", "1": "Sterling,Auston", "2": "Klatzky,RobertaL.", "3": "Lin,MingC."}}