{"edges": [[0, 1], [0, 2], [0, 3], [0, 4], [1, 0], [1, 2], [1, 3], [1, 4], [2, 1], [2, 0], [2, 3], [2, 4], [3, 1], [3, 0], [3, 2], [3, 4], [4, 1], [4, 0], [4, 2], [4, 3]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4"}, "count": 1, "cite": 6, "position": 2.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.2, "totalCite": 6.0, "totalPosition": 5.0, "paper": [{"title": "SLAMCast: Large-Scale, Real-Time 3D Reconstruction and Streaming for lmmersive Multi-Client Live Telepresence", "author": ["Stotko,Patrick", "Krunnpen,Stefan", "Hullin,MatthiasB.", "Weinnnann,Michael", "Klein,Reinhard"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2019.2899231", "keywords": "", "abstract": "Real-time 3D scene reconstruction from RGB-D sensor data, as well as the exploration of such data in VRiAR settings, has seen tremendous progress in recent years. The combination of both these components into telepresence systems, however, comes with significant technical challenges. All approaches proposed so far are extremely demanding on input and output devices, compute resources and transmission bandwidth, and they do not reach the level of immediacy required for applications such as remote collaboration. Here, we introduce what we believe is the first practical client-server system for real-time capture and many-user exploration of static 3D scenes. Our system is based on the observation that interactive frame rates are sufficient for capturing and reconstruction, and real-time performance is only required on the client site to achieve lag-free view updates when rendering the 3D model. Starting from this insight, we extend previous voxel block hashing frameworks by introducing a novel thread-safe GPU hash map data structure that is robust under massively concurrent retrieval, insertion and removal of entries on a thread level. We further propose a novel transmission scheme for volume data that is specifically targeted to Marching Cubes geometry reconstruction and enables a 90% reduction in bandwidth between server and exploration clients. The resulting system poses very moderate requirements on network bandwidth, latency and client-side computation, which enables it to rely entirely on consumer-grade hardware, including mobile devices. We demonstrate that our technique achieves state-of-the-art representation accuracy while providing, for any number of clients, an immersive and fluid lag-free viewing experience even during network outages.", "cite": 6, "year": "2019"}], "name": "Krunnpen,Stefan", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "0", "target": "4"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "1", "target": "4"}, {"source": "2", "target": "3"}, {"source": "2", "target": "4"}, {"source": "3", "target": "4"}], "year": 2019, "authorId": {"0": "Krunnpen,Stefan", "1": "Stotko,Patrick", "2": "Hullin,MatthiasB.", "3": "Weinnnann,Michael", "4": "Klein,Reinhard"}}