{"edges": [[0, 1], [0, 2], [0, 3], [1, 2], [1, 0], [1, 3], [2, 1], [2, 0], [2, 3], [3, 1], [3, 2], [3, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3"}, "count": 1, "cite": 4, "position": 3.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.25, "totalCite": 4.0, "totalPosition": 4.0, "paper": [{"title": "Interpersonal Affordances and Social Dynamics in Collaborative Immersive Virtual Environments: Passing Together Through Apertures", "author": ["Buck,LaurenE.", "Rieser,JohnJ.", "Narasimham,Gayathri", "Bodenheimer,Bobby"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2019.2899232", "keywords": "", "abstract": "An essential question in understanding how to develop and build collaborative immersive virtual environments (IVES) is recognizing how people perform actions together. Many actions in the real world require that people act without prior planning, and these actions are executed quite successfully. In this paper, we study the common action of two people passing through an aperture together in both the real world (Experiment 1) and in a distributed, collaborative IVE (Experiment 2). The aperture's width is varied from too narrow to be passable to so wide as to be easily passable by both participants together simultaneously. We do this in the real world for all possible gender-based pairings. In virtual reality, however. there is potential for the gender of the participant and the gender of the self-avatar to be different. We also investigate the joint action for all possible gender-based pairings in the distributed IVE. Results indicated that, in the real world, social dynamics between gendered pairings emerged; male-male pairings refused to concede to one another until absolutely necessary while other pairings did not. Male-female pairings were most likely to provide ample space to one another during passage. These behaviors seemed not to appear in the IVE, and avatar gender across all pairings generated no significant behavioral differences. In addition, participants tended to require wider gaps to allow for passage in the IVE. These findings establish base knowledge of social dynamics and affordance behaviors within multi-user IVES.", "cite": 4, "year": "2019"}], "name": "Narasimham,Gayathri", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "2", "target": "3"}], "year": 2019, "authorId": {"0": "Narasimham,Gayathri", "1": "Buck,LaurenE.", "2": "Rieser,JohnJ.", "3": "Bodenheimer,Bobby"}}