{"edges": [[0, 1], [0, 2], [0, 3], [1, 2], [1, 0], [1, 3], [2, 4], [2, 5], [2, 6], [2, 7], [2, 1], [2, 0], [2, 3], [3, 1], [3, 2], [3, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7"}, "count": 1, "cite": 1, "position": 3.0, "connect": 1.0, "totalConnect": 1.6, "totalCount": 0.25, "totalCite": 1.0, "totalPosition": 4.5, "paper": [{"title": "PaperCraft3D: Paper-Based 3D Modeling and Scene Fabrication", "author": ["Paczkowski,Patrick", "Dorsey,Julie", "Rushmeier,Holly", "Kim,MinH."], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2820068", "keywords": "", "abstract": "A 3D modeling system with all-inclusive functionality is too demanding for a casual 3D modeler to learn. There has been a shift towards more approachable systems, with easy-to-learn, intuitive interfaces. However, most modeling systems still employ mouse and keyboard interfaces, despite the ubiquity of tablet devices and the benefits of multi-touch interfaces. We introduce an alternative 3D modeling and fabrication paradigm using developable surfaces, inspired by traditional papercrafting, and we implement it as a complete system designed for a multi-touch tablet, allowing a user to fabricate 3D scenes. We demonstrate the modeling and fabrication process of assembling complex 3D scenes from a collection of simpler models, in turn shaped through operations applied to virtual paper. Our fabrication method facilitates the assembly of the scene with real paper by automatically converting scenes into a series of cutouts with appropriately added fiducial markers and supporting structures. Our system assists users in creating occluded supporting structures to help maintain the spatial and rigid properties of a scene without compromising its aesthetic qualities. We demonstrate several 3D scenes modeled and fabricated in our system, and evaluate the faithfulness of our fabrications relative to their virtual counterparts and 3D-printed fabrications.", "cite": 1, "year": "2019"}], "name": "Rushmeier,Holly", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}, {"id": "7"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "2", "target": "4"}, {"source": "2", "target": "5"}, {"source": "2", "target": "6"}, {"source": "2", "target": "7"}, {"source": "2", "target": "3"}], "year": 2019, "authorId": {"0": "Rushmeier,Holly", "1": "Paczkowski,Patrick", "2": "Dorsey,Julie", "3": "Kim,MinH.", "4": "Zheng,Yi", "5": "Chen,Yanyun", "6": "Fei,Guangzheng", "7": "Wu,Enhua"}}