{"edges": [[0, 1], [0, 2], [0, 3], [0, 4], [0, 5], [0, 6], [0, 7], [0, 8], [1, 2], [1, 3], [1, 4], [1, 0], [2, 1], [2, 3], [2, 4], [2, 0], [3, 1], [3, 2], [3, 4], [3, 0], [4, 1], [4, 2], [4, 3], [4, 0], [5, 6], [5, 7], [5, 8], [5, 0], [6, 5], [6, 7], [6, 8], [6, 0], [7, 5], [7, 6], [7, 8], [7, 0], [8, 5], [8, 6], [8, 7], [8, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7", "8": "8"}, "count": 2, "cite": 3, "position": 5.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.2222222222222222, "totalCite": 1.5, "totalPosition": 5.0, "paper": [{"title": "VERAM: View-Enhanced Recurrent Attention Model for 3D Shape Classification", "author": ["Chen,Songle", "Zheng,Lintao", "Zhang,Yan", "Sun,Zhixin", "Xu,Kai"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2866793", "keywords": "", "abstract": "Multi-view deep neural network is perhaps the most successful approach in 3D shape classification. However, the fusion of multi-view features based on max or average pooling lacks a view selection mechanism, limiting its application in, e.g., multi-view active object recognition by a robot. This paper presents VERAM, a view-enhanced recurrent attention model capable of actively selecting a sequence of views for highly accurate 3D shape classification. VERAM addresses an important issue commonly found in existing attention-based models, i.e., the unbalanced training of the subnetworks corresponding to next view estimation and shape classification. The classification subnetwork is easily overfitted while the view estimation one is usually poorly trained, leading to a suboptimal classification performance. This is surmounted by three essential view-enhancement strategies: 1) enhancing the information flow of gradient backpropagation for the view estimation subnetwork, 2) devising a highly informative reward function for the reinforcement training of view estimation and 3) formulating a novel loss function that explicitly circumvents view duplication. Taking grayscale image as input and AlexNet as CNN architecture, VERAM with 9 views achieves instance-level and class-level accuracy of 95.5 and 95.3 percent on ModelNet10, 93.7 and 92.1 percent on ModelNet40, both are the state-of-the-art performance under the same number of views.", "cite": 2, "year": "2019"}, {"title": "Learning Discriminative 3D Shape Representations by View Discerning Networks", "author": ["Leng,Biao", "Zhang,Cheng", "Zhou,Xiaocheng", "Xu,Cheng", "Xu,Kai"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2865317", "keywords": "", "abstract": "In view-based 3D shape recognition, extracting discriminative visual representation of 3D shapes from projected images is considered the core problem. Projections with low discriminative ability can adversely influence the final 3D shape representation. Especially under the real situations with background clutter and object occlusion, the adverse effect is even more severe. To resolve this problem, we propose a novel deep neural network, View Discerning Network, which learns to judge the quality of views and adjust their contributions to the representation of shapes. In this network, a Score Generation Unit is devised to evaluate the quality of each projected image with score vectors. These score vectors are used to weight the image features and the weighted features perform much better than original features in 3D shape recognition task. In particular, we introduce two structures of Score Generation Unit, Channel-wise Score Unit and Part-wise Score Unit, to assess the quality of feature maps from different perspectives. Our network aggregates features and scores in an end-to-end framework, so that final shape descriptors are directly obtained from its output. Our experiments on ModelNet and ShapeNet Core55 show that View Discerning Network outperforms the state-of-the-arts in terms of the retrieval task, with excellent robustness against background clutter and object occlusion.", "cite": 1, "year": "2019"}], "name": "Xu,Kai", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}, {"id": "7"}, {"id": "8"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "0", "target": "4"}, {"source": "0", "target": "5"}, {"source": "0", "target": "6"}, {"source": "0", "target": "7"}, {"source": "0", "target": "8"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "1", "target": "4"}, {"source": "2", "target": "3"}, {"source": "2", "target": "4"}, {"source": "3", "target": "4"}, {"source": "5", "target": "6"}, {"source": "5", "target": "7"}, {"source": "5", "target": "8"}, {"source": "6", "target": "7"}, {"source": "6", "target": "8"}, {"source": "7", "target": "8"}], "year": 2019, "authorId": {"0": "Xu,Kai", "1": "Chen,Songle", "2": "Zheng,Lintao", "3": "Zhang,Yan", "4": "Sun,Zhixin", "5": "Leng,Biao", "6": "Zhang,Cheng", "7": "Zhou,Xiaocheng", "8": "Xu,Cheng"}}