{"edges": [[0, 1], [1, 2], [1, 3], [1, 4], [1, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4"}, "count": 1, "cite": 1, "position": 1.0, "connect": 1.0, "totalConnect": 1.25, "totalCount": 0.4, "totalCite": 0.5, "totalPosition": 3.0, "paper": [{"title": "Efficient and Anti-Aliased Trimming for Rendering Large NURBS Models", "author": ["Schollmeyer,Andre", "Froehlich,Bernd"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2814987", "keywords": "", "abstract": "In Computer-Aided Design (CAD), Non-Uniform Rational B-Splines (NURBS) are a common model representation for export, simulation and visualization. In this paper, we present a direct rendering method for trimmed NURBS models based on their parametric description. Our approach builds on a novel trimming method and a three-pass pipeline which both allow for a sub-pixel precise visualization. The rendering pipeline bypasses tessellation limitations of current hardware using a feedback mechanism. In contrast to existing work, our trimming method scales well with a large number of trim curves and estimates the trimmed surface's footprint in screen-space which allows for an anti-aliasing with minimal performance overhead. Fragments with trimmed edges are routed into a designated off-screen buffer for subsequent blending with background faces. The evaluation of the presented algorithms shows that our rendering system can handle CAD models with ten thousands of trimmed NURBS surfaces. The suggested two-level data structure used for trimming outperforms state-of-the-art methods while being more precise and memory efficient. Our curve coverage estimation used for anti-aliasing provides an efficient trade-off between quality and performance compared to multisampling or screen-space anti-aliasing approaches.", "cite": 1, "year": "2019"}], "name": "Schollmeyer,Andre", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}], "edgess": [{"source": "0", "target": "1"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "1", "target": "4"}], "year": 2019, "authorId": {"0": "Schollmeyer,Andre", "1": "Froehlich,Bernd", "2": "Riehmann,Patrick", "3": "Kiesel,Dora", "4": "Kohlhaas,Martin"}}