{"edges": [[0, 1], [0, 2], [0, 3], [1, 0], [1, 2], [1, 3], [2, 0], [2, 1], [2, 3], [3, 0], [3, 1], [3, 2]], "features": {"0": "0", "1": "1", "2": "2", "3": "3"}, "count": 1, "cite": 9, "position": 1.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.25, "totalCite": 9.0, "totalPosition": 4.0, "paper": [{"title": "Feature Preserving Mesh Denoising Based on Graph Spectral Processing", "author": ["Arvanitis,Gerasimos", "Lalos,ArisS.", "Moustakas,Konstantinos", "Fakotakis,Nikos"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2802926", "keywords": "", "abstract": "The increasing interest for reliable generation of large scale scenes and objects has facilitated several real-time applications. Although the resolution of the new generation geometry scanners are constantly improving, the output models, are inevitably noisy, requiring sophisticated approaches that remove noise while preserving sharp features. Moreover, we no longer deal exclusively with individual shapes, but with entire scenes resulting in a sequence of 3D surfaces that are affected by noise with different characteristics due to variable environmental factors (e.g., lighting conditions, orientation of the scanning device). In this work, we introduce a novel coarse-to-fine graph spectral processing approach that exploits the fact that the sharp features reside in a low dimensional structure hidden in the noisy 3D dataset. In the coarse step, the mesh is processed in parts, using a model based Bayesian learning method that identifies the noise level in each part and the subspace where the features lie. In the feature-aware fine step, we iteratively smooth face normals and vertices, while preserving geometric features. Extensive evaluation studies carried out under a broad set of complex noise patterns verify the superiority of our approach as compared to the state-of-the-art schemes, in terms of reconstruction quality and computational complexity.", "cite": 9, "year": "2019"}], "name": "Arvanitis,Gerasimos", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "2", "target": "3"}], "year": 2019, "authorId": {"0": "Arvanitis,Gerasimos", "1": "Lalos,ArisS.", "2": "Moustakas,Konstantinos", "3": "Fakotakis,Nikos"}}