{"edges": [[0, 1], [0, 2], [0, 3], [0, 4], [0, 3], [1, 0], [1, 2], [1, 3], [2, 0], [2, 1], [2, 3], [3, 0], [3, 1], [3, 2], [3, 0], [3, 4], [4, 0], [4, 3], [4, 5], [4, 6], [4, 7], [4, 8], [3, 0], [3, 1], [3, 2], [3, 0], [3, 4]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7", "8": "8"}, "count": 2, "cite": 16, "position": 1.0, "connect": 1.25, "totalConnect": 2.25, "totalCount": 0.3333333333333333, "totalCite": 6.666666666666667, "totalPosition": 4.0, "paper": [{"title": "Lineage: Visualizing Multivariate Clinical Data in Genealogy Graphs", "author": ["Nobre,Carolina", "Gehlenborg,Nils", "Coon,Hilary", "Lex,Alexander"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2811488", "keywords": "", "abstract": "The majority of diseases that are a significant challenge for public and individual heath are caused by a combination of hereditary and environmental factors. In this paper we introduce Lineage, a novel visual analysis tool designed to support domain experts who study such multifactorial diseases in the context of genealogies. Incorporating familial relationships between cases with other data can provide insights into shared genomic variants and shared environmental exposures that may be implicated in such diseases. We introduce a data and task abstraction, and argue that the problem of analyzing such diseases based on genealogical, clinical, and genetic data can be mapped to a multivariate graph visualization problem. The main contribution of our design study is a novel visual representation for tree-like, multivariate graphs, which we apply to genealogies and clinical data about the individuals in these families. We introduce data-driven aggregation methods to scale to multiple families. By designing the genealogy graph layout to align with a tabular view, we are able to incorporate extensive, multivariate attributes in the analysis of the genealogy without cluttering the graph. We validate our designs by conducting case studies with our domain collaborators.", "cite": 8, "year": "2019"}, {"title": "Juniper: A Tree plus Table Approach to Multivariate Graph Visualization", "author": ["Nobre,Carolina", "Streit,Marc", "Lex,Alexander"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2865149", "keywords": "", "abstract": "Analyzing large, multivariate graphs is an important problem in many domains, yet such graphs are challenging to visualize. In this paper, we introduce a novel, scalable, tree+table multivariate graph visualization technique, which makes many tasks related to multivariate graph analysis easier to achieve. The core principle we follow is to selectively query for nodes or subgraphs of interest and visualize these subgraphs as a spanning tree of the graph. The tree is laid out linearly, which enables us to juxtapose the nodes with a table visualization where diverse attributes can be shown. We also use this table as an adjacency matrix, so that the resulting technique is a hybrid node-link/adjacency matrix technique. We implement this concept in Juniper and complement it with a set of interaction techniques that enable analysts to dynamically grow, restructure, and aggregate the tree, as well as change the layout or show paths between nodes. We demonstrate the utility of our tool in usage scenarios for different multivariate networks: a bipartite network of scholars, papers, and citation metrics and a multitype network of story characters, places, books, etc.", "cite": 8, "year": "2019"}], "name": "Nobre,Carolina", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}, {"id": "7"}, {"id": "8"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "0", "target": "4"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "2", "target": "3"}, {"source": "3", "target": "4"}, {"source": "4", "target": "5"}, {"source": "4", "target": "6"}, {"source": "4", "target": "7"}, {"source": "4", "target": "8"}], "year": 2019, "authorId": {"0": "Nobre,Carolina", "1": "Gehlenborg,Nils", "2": "Coon,Hilary", "3": "Lex,Alexander", "4": "Streit,Marc", "5": "Stitz,Holger", "6": "Gratzl,Samuel", "7": "Piringer,Harald", "8": "Zichner,Thomas"}}