{"edges": [[0, 1], [0, 2], [0, 3], [0, 4], [0, 5], [0, 6], [0, 7], [1, 0], [1, 2], [1, 3], [1, 4], [2, 1], [2, 0], [2, 3], [2, 4], [3, 1], [3, 0], [3, 2], [3, 4], [4, 1], [4, 0], [4, 2], [4, 3], [5, 6], [5, 0], [5, 7], [6, 5], [6, 0], [6, 7], [7, 8], [7, 9], [7, 10], [7, 11], [7, 12], [7, 13], [7, 14], [7, 5], [7, 6], [7, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7", "8": "8", "9": "9", "10": "10", "11": "11", "12": "12", "13": "13", "14": "14"}, "count": 2, "cite": 8, "position": 2.5, "connect": 1.0, "totalConnect": 1.6956521739130435, "totalCount": 0.3333333333333333, "totalCite": 2.6, "totalPosition": 3.8, "paper": [{"title": "Smart Brushing for Parallel Coordinates", "author": ["Roberts,RichardC.", "Laramee,RobertS.", "Smith,GaryA.", "Brookes,Paul", "D'Cruze,Tony"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2808969", "keywords": "", "abstract": "The Parallel Coordinates plot is a popular tool for the visualization of high-dimensional data. One of the main challenges when using parallel coordinates is occlusion and overplotting resulting from large data sets. Brushing is a popular approach to address these challenges. Since its conception, limited improvements have been made to brushing both in the form of visual design and functional interaction. We present a set of novel, smart brushing techniques that enhance the standard interactive brushing of a parallel coordinates plot. We introduce two new interaction concepts: Higher-order, sketch-based brushing, and smart, data-driven brushing. Higher-order brushes support interactive, flexible, n-dimensional pattern searches involving an arbitrary number of dimensions. Smart, data-driven brushing provides interactive, real-time guidance to the user during the brushing process based on derived meta-data. In addition, we implement a selection of novel enhancements and user options that complement the two techniques as well as enhance the exploration and analytical ability of the user. We demonstrate the utility and evaluate the results using a case study with a large, high-dimensional, real-world telecommunication data set and we report domain expert feedback from the data suppliers.", "cite": 4, "year": "2019"}, {"title": "Visual Analysis of Spatio-temporal Relations of Pairwise Attributes in Unsteady Flow", "author": ["Berenjkoub,Marzieh", "Monico,RodolfoOstilla", "Laramee,RobertS.", "Chen,Guoning"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864817", "keywords": "", "abstract": "Despite significant advances in the analysis and visualization of unsteady flow, the interpretation of it's behavior still remains a challenge. In this work, we focus on the linear correlation and non-linear dependency of different physical attributes of unsteady flows to aid their study from a new perspective. Specifically, we extend the existing spatial correlation quantification, i.e. the Local Correlation Coefficient (LCC), to the spatio-temporal domain to study the correlation of attribute-pairs from both the Eulerian and Lagrangian views. To study the dependency among attributes, which need not be linear, we extend and compute the mutual information (MI) among attributes over time. To help visualize and interpret the derived correlation and dependency among attributes associated with a particle, we encode the correlation and dependency values on individual pathlines. Finally, to utilize the correlation and MI computation results to identify regions with interesting flow behavior, we propose a segmentation strategy of the flow domain based on the ranking of the strength of the attributes relations. We have applied our correlation and dependency metrics to a number of 2D and 3D unsteady flows with varying spatio-temporal kernel sizes to demonstrate and assess their effectiveness.", "cite": 4, "year": "2019"}], "name": "Laramee,RobertS.", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}, {"id": "7"}, {"id": "8"}, {"id": "9"}, {"id": "10"}, {"id": "11"}, {"id": "12"}, {"id": "13"}, {"id": "14"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "0", "target": "4"}, {"source": "0", "target": "5"}, {"source": "0", "target": "6"}, {"source": "0", "target": "7"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "1", "target": "4"}, {"source": "2", "target": "3"}, {"source": "2", "target": "4"}, {"source": "3", "target": "4"}, {"source": "5", "target": "6"}, {"source": "5", "target": "7"}, {"source": "6", "target": "7"}, {"source": "7", "target": "8"}, {"source": "7", "target": "9"}, {"source": "7", "target": "10"}, {"source": "7", "target": "11"}, {"source": "7", "target": "12"}, {"source": "7", "target": "13"}, {"source": "7", "target": "14"}], "year": 2019, "authorId": {"0": "Laramee,RobertS.", "1": "Roberts,RichardC.", "2": "Smith,GaryA.", "3": "Brookes,Paul", "4": "D'Cruze,Tony", "5": "Berenjkoub,Marzieh", "6": "Monico,RodolfoOstilla", "7": "Chen,Guoning", "8": "Shi,Lieyu", "9": "SLaramee,Robert", "10": "Govyadinov,PavelA.", "11": "Womack,Tasha", "12": "Eriksen,JasonL.", "13": "Mayerich,David", "14": "Xu,Kaoji"}}