{"edges": [[0, 1], [0, 2], [1, 0], [1, 2], [2, 1], [2, 0]], "features": {"0": "0", "1": "1", "2": "2"}, "count": 1, "cite": 0, "position": 2.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.3333333333333333, "totalCite": 0.0, "totalPosition": 3.0, "paper": [{"title": "Surface Reconstruction from Discrete Indicator Functions", "author": ["Evrard,Fabien", "Denner,Fabian", "vanWachem,Berend"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2809751", "keywords": "", "abstract": "This paper introduces a procedure for the calculation of the vertex positions in Marching-Cubes-like surface reconstruction methods, when the surface to reconstruct is characterised by a discrete indicator function. Linear or higher order methods for the vertex interpolation problem require a smooth input function. Therefore, the interpolation methodology to convert a discontinuous indicator function into a triangulated surface is non-trivial. Analytical formulations for this specific vertex interpolation problem have been derived for the 2D case by Manson et al. [Eurographics (2011) 30, 2] and the straightforward application of their method to a 3D case gives satisfactory visual results. A rigorous extension to 3D, however, requires a least-squares problem to be solved for the discrete values of a symmetric neighbourhood. It thus relies on an extra layer of information, and comes at a significantly higher cost. This paper proposes a novel vertex interpolation method which yields second-order-accurate reconstructed surfaces in the general 3D case, without altering the locality of the method. The associated errors are analysed and comparisons are made with linear vertex interpolation and the analytical formulations of Manson et al. [Eurographics (2011) 30, 2].", "cite": 0, "year": "2019"}], "name": "Denner,Fabian", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "2"}], "year": 2019, "authorId": {"0": "Denner,Fabian", "1": "Evrard,Fabien", "2": "vanWachem,Berend"}}