{"edges": [[0, 1], [0, 2], [0, 3], [1, 2], [1, 3], [1, 0], [2, 1], [2, 3], [2, 0], [3, 1], [3, 2], [3, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3"}, "count": 1, "cite": 0, "position": 4.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.25, "totalCite": 0.0, "totalPosition": 4.0, "paper": [{"title": "A Psychophysical Evaluation of Texture Compression Masking Effects", "author": ["Lavoue,Guillaume", "Langer,Michael", "Peytavie,Adrien", "Poulin,Pierre"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2805355", "keywords": "", "abstract": "Lossy texture compression is increasingly used to reduce GPU memory and bandwidth consumption. However, as raised by recent studies, evaluating the quality of compressed textures is a difficult problem. Indeed using Peak Signal-to-Noise Ratio (PSNR) on texture images, like done in most applications, may not be a correct way to proceed. In particular, there is evidence that masking effects apply when the texture image is mapped on a surface and combined with other textures (e.g., affecting geometry or normal). These masking effects have to be taken into account when compressing a set of texture maps, in order to have a real understanding of the visual impact of the compression artifacts on the rendered images. In this work, we present the first psychophysical experiment investigating the perceptual impact of texture compression on rendered images. We explore the influence of compression bit rate, light direction, and diffuse and normal map content on the visual impact of artifacts. The collected data reveal huge masking effects from normal map to diffuse map artifacts and vice versa, and reveal the weakness of PSNR applied on individual textures for evaluating compression quality. The results allow us to also analyze the performance and failures of image quality metrics for predicting the visibility of these artifacts. We finally provide some recommendations for evaluating the quality of texture compression and show a practical application to approximating the distortion measured on a rendered 3D shape.", "cite": 0, "year": "2019"}], "name": "Poulin,Pierre", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "2", "target": "3"}], "year": 2019, "authorId": {"0": "Poulin,Pierre", "1": "Lavoue,Guillaume", "2": "Langer,Michael", "3": "Peytavie,Adrien"}}