{"edges": [[0, 1], [0, 2], [1, 3], [1, 2], [1, 0], [1, 2], [2, 3], [2, 1], [2, 0], [2, 1]], "features": {"0": "0", "1": "1", "2": "2", "3": "3"}, "count": 1, "cite": 0, "position": 1.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.5, "totalCite": 0.0, "totalPosition": 3.0, "paper": [{"title": "Animation Plans for Before-and-After Satellite Images", "author": ["Lobo,Maria-Jesus", "Appert,Caroline", "Pietriga,Emmanuel"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2796557", "keywords": "", "abstract": "Before-and-after image pairs show how entities in a given region have evolved over a specific period of time. Satellite images are a major source of such data, that capture how natural phenomena or human activity impact a geographical area. These images are used both for data analysis and to illustrate the resulting findings to diverse audiences. The simple techniques used to display them, including juxtaposing, swapping and monolithic blending, often fail to convey the underlying phenomenon in a meaningful manner. We introduce Baia, a framework to create advanced animated transitions, called animation plans, between before-and-after images. Baia relies on a pixel-based transition model that gives authors much expressive power, while keeping animations for common types of changes easy to create thanks to predefined animation primitives. We describe our model, the associated animation editor, and report on two user studies. In the first study, advanced transitions enabled by Baia were compared to monolithic blending, and perceived as more realistic and better at focusing viewer's attention on a region of interest than the latter. The second study aimed at gathering feedback about the usability of Baia's animation editor.", "cite": 0, "year": "2019"}], "name": "Lobo,Maria-Jesus", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "3"}, {"source": "1", "target": "2"}, {"source": "2", "target": "3"}], "year": 2019, "authorId": {"0": "Lobo,Maria-Jesus", "1": "Appert,Caroline", "2": "Pietriga,Emmanuel", "3": "Romat,Hugo"}}