{"edges": [[0, 1], [0, 2], [1, 0], [1, 2], [1, 3], [1, 2], [2, 4], [2, 0], [2, 1], [2, 3], [2, 1]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4"}, "count": 1, "cite": 4, "position": 1.0, "connect": 1.0, "totalConnect": 1.8333333333333333, "totalCount": 0.8, "totalCite": 2.75, "totalPosition": 2.25, "paper": [{"title": "ColorMap(ND): A Data-Driven Approach and Tool for Mapping Multivariate Data to Color", "author": ["Cheng,Shenghui", "Xu,Wei", "Mueller,Klaus"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2808489", "keywords": "", "abstract": "A wide variety of color schemes have been devised for mapping scalar data to color. We address the challenge of color-mapping multivariate data. While a number of methods can map low-dimensional data to color, for example, using bilinear or barycentric interpolation for two or three variables, these methods do not scale to higher data dimensions. Likewise, schemes that take a more artistic approach through color mixing and the like also face limits when it comes to the number of variables they can encode. Our approach does not have these limitations. It is data driven in that it determines a proper and consistent color map from first embedding the data samples into a circular interactive multivariate color mapping display (ICD) and then fusing this display with a convex (CIE HCL) color space. The variables (data attributes) are arranged in terms of their similarity and mapped to the ICD's boundary to control the embedding. Using this layout, the color of a multivariate data sample is then obtained via modified generalized barycentric coordinate interpolation of the map. The system we devised has facilities for contrast and feature enhancement, supports both regular and irregular grids, can deal with multi-field as well as multispectral data, and can produce heat maps, choropleth maps, and diagrams such as scatterplots.", "cite": 4, "year": "2019"}], "name": "Cheng,Shenghui", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "2", "target": "4"}, {"source": "2", "target": "3"}], "year": 2019, "authorId": {"0": "Cheng,Shenghui", "1": "Xu,Wei", "2": "Mueller,Klaus", "3": "Xie,Cong", "4": "Bowman,Doug"}}