{"edges": [[0, 1], [0, 2], [0, 3], [0, 2], [1, 0], [1, 2], [2, 4], [2, 1], [2, 0], [2, 3], [2, 0], [3, 0], [3, 2], [2, 4], [2, 1], [2, 0], [2, 3], [2, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4"}, "count": 2, "cite": 11, "position": 2.0, "connect": 1.3333333333333333, "totalConnect": 3.0, "totalCount": 0.8, "totalCite": 2.75, "totalPosition": 2.25, "paper": [{"title": "ColorMap(ND): A Data-Driven Approach and Tool for Mapping Multivariate Data to Color", "author": ["Cheng,Shenghui", "Xu,Wei", "Mueller,Klaus"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2808489", "keywords": "", "abstract": "A wide variety of color schemes have been devised for mapping scalar data to color. We address the challenge of color-mapping multivariate data. While a number of methods can map low-dimensional data to color, for example, using bilinear or barycentric interpolation for two or three variables, these methods do not scale to higher data dimensions. Likewise, schemes that take a more artistic approach through color mixing and the like also face limits when it comes to the number of variables they can encode. Our approach does not have these limitations. It is data driven in that it determines a proper and consistent color map from first embedding the data samples into a circular interactive multivariate color mapping display (ICD) and then fusing this display with a convex (CIE HCL) color space. The variables (data attributes) are arranged in terms of their similarity and mapped to the ICD's boundary to control the embedding. Using this layout, the color of a multivariate data sample is then obtained via modified generalized barycentric coordinate interpolation of the map. The system we devised has facilities for contrast and feature enhancement, supports both regular and irregular grids, can deal with multi-field as well as multispectral data, and can produce heat maps, choropleth maps, and diagrams such as scatterplots.", "cite": 4, "year": "2019"}, {"title": "A Visual Analytics Framework for the Detection of Anomalous Call Stack Trees in High Performance Computing Applications", "author": ["Xie,Cong", "Xu,Wei", "Mueller,Klaus"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2865026", "keywords": "", "abstract": "Anomalous runtime behavior detection is one of the most important tasks for performance diagnosis in High Performance Computing (HPC). Most of the existing methods find anomalous executions based on the properties of individual functions, such as execution time. However, it is insufficient to identify abnormal behavior without taking into account the context of the executions, such as the invocations of children functions and the communications with other HPC nodes. We improve upon the existing anomaly detection approaches by utilizing the call stack structures of the executions, which record rich temporal and contextual information. With our call stack tree (CSTree) representation of the executions, we formulate the anomaly detection problem as finding anomalous tree structures in a call stack forest. The CSTrees are converted to vector representations using our proposed stack2vec embedding. Structural and temporal visualizations of CSTrees are provided to support users in the identification and verification of the anomalies during an active anomaly detection process. Three case studies of real-world HPC applications demonstrate the capabilities of our approach.", "cite": 7, "year": "2019"}], "name": "Xu,Wei", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "1", "target": "2"}, {"source": "2", "target": "4"}, {"source": "2", "target": "3"}], "year": 2019, "authorId": {"0": "Xu,Wei", "1": "Cheng,Shenghui", "2": "Mueller,Klaus", "3": "Xie,Cong", "4": "Bowman,Doug"}}