{"edges": [[0, 1], [0, 2], [1, 3], [1, 0], [2, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3"}, "count": 2, "cite": 0, "position": 1.0, "connect": 1.0, "totalConnect": 1.6666666666666667, "totalCount": 0.75, "totalCite": 0.6666666666666666, "totalPosition": 2.0, "paper": [{"title": "Guest Editor's Introduction to the Special Section on I3D", "author": ["Wyman,Chris", "Yuksel,Cem"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2877237", "keywords": "", "abstract": " AU Wyman, Chris Yuksel, Cem TI Guest Editor's Introduction to the Special Section on I3D SO IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS VL 25 IS 2 BP 1269 EP 1269 DI 10.1109/TVCG.2018.2877237 PD FEB 2019 PY 2019", "cite": 0, "year": "2019"}, {"title": "Improved Alpha Testing Using Hashed Sampling", "author": ["Wyman,Chris", "McGuire,Morgan"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2017.2739149", "keywords": "", "abstract": "We further describe and analyze the idea of hashed alpha testing from Wyman and McGuire [1], which builds on stochastic alpha testing and simplifies stochastic transparency. Typically, alpha testing provides a simple mechanism to mask out complex silhouettes using simple proxy geometry with applied alpha textures. While widely used, alpha testing has a long-standing problem: geometry can disappear entirely as alpha mapped polygons recede with distance. As foveated rendering for virtual reality spreads, this problem worsens as peripheral minification and prefiltering introduce this problem on nearby objects. We first introduce the notion of stochastic alpha testing, which replaces a fixed alpha threshold of alpha(tau) = 0.5 with a randomly chosen at alpha(tau) is an element of [0..1). This entirely avoids the problem of disappearing alpha-tested geometry, but introduces temporal noise. Hashed alpha testing uses a hash function to choose alpha(tau) procedurally. With a good hash function and inputs, hashed alpha testing maintains distant geometry without introducing more temporal flicker than traditional alpha testing. We also describe how hashed alpha interacts with temporal antialiasing and applies to alpha-to-coverage and screen-door transparency. Because hashed alpha testing addresses alpha test aliasing by introducing stable sampling, it has implications in other domains where increased sample stability is desirable. We show how our hashed sampling might apply to other stochastic effects.", "cite": 0, "year": "2019"}], "name": "Wyman,Chris", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "3"}], "year": 2019, "authorId": {"0": "Wyman,Chris", "1": "Yuksel,Cem", "2": "McGuire,Morgan", "3": "Wu,Kui"}}