{"edges": [[0, 1], [0, 2], [0, 3], [0, 4], [0, 5], [0, 6], [1, 7], [1, 8], [1, 2], [1, 0], [1, 2], [2, 1], [2, 7], [2, 8], [2, 1], [2, 0], [3, 4], [3, 5], [3, 6], [3, 0], [4, 3], [4, 5], [4, 6], [4, 0], [5, 3], [5, 4], [5, 6], [5, 0], [6, 3], [6, 4], [6, 5], [6, 0]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6", "7": "7", "8": "8"}, "count": 2, "cite": 12, "position": 3.5, "connect": 1.0, "totalConnect": 1.8823529411764706, "totalCount": 0.3333333333333333, "totalCite": 6.666666666666667, "totalPosition": 4.0, "paper": [{"title": "Juniper: A Tree plus Table Approach to Multivariate Graph Visualization", "author": ["Nobre,Carolina", "Streit,Marc", "Lex,Alexander"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2865149", "keywords": "", "abstract": "Analyzing large, multivariate graphs is an important problem in many domains, yet such graphs are challenging to visualize. In this paper, we introduce a novel, scalable, tree+table multivariate graph visualization technique, which makes many tasks related to multivariate graph analysis easier to achieve. The core principle we follow is to selectively query for nodes or subgraphs of interest and visualize these subgraphs as a spanning tree of the graph. The tree is laid out linearly, which enables us to juxtapose the nodes with a table visualization where diverse attributes can be shown. We also use this table as an adjacency matrix, so that the resulting technique is a hybrid node-link/adjacency matrix technique. We implement this concept in Juniper and complement it with a set of interaction techniques that enable analysts to dynamically grow, restructure, and aggregate the tree, as well as change the layout or show paths between nodes. We demonstrate the utility of our tool in usage scenarios for different multivariate networks: a bipartite network of scholars, papers, and citation metrics and a multitype network of story characters, places, books, etc.", "cite": 8, "year": "2019"}, {"title": "KnowledgePearls: Provenance-Based Visualization Retrieval", "author": ["Stitz,Holger", "Gratzl,Samuel", "Piringer,Harald", "Zichner,Thomas", "Streit,Marc"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2865024", "keywords": "", "abstract": "Storing analytical provenance generates a knowledge base with a large potential for recalling previous results and guiding users in future analyses. However, without extensive manual creation of meta information and annotations by the users, search and retrieval of analysis states can become tedious. We present KnowledgePearls, a solution for efficient retrieval of analysis states that are structured as provenance graphs containing automatically recorded user interactions and visualizations. As a core component, we describe a visual interface for querying and exploring analysis states based on their similarity to a partial definition of a requested analysis state. Depending on the use case, this definition may be provided explicitly by the user by formulating a search query or inferred from given reference states. We explain our approach using the example of efficient retrieval of demographic analyses by Hans Rosling and discuss our implementation for a fast look-up of previous states. Our approach is independent of the underlying visualization framework. We discuss the applicability for visualizations which are based on the declarative grammar Vega and we use a Vega-based implementation of Gapminder as guiding example. We additionally present a biomedical case study to illustrate how KnowledgePearls facilitates the exploration process by recalling states from earlier analyses.", "cite": 4, "year": "2019"}], "name": "Streit,Marc", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}, {"id": "7"}, {"id": "8"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "0", "target": "4"}, {"source": "0", "target": "5"}, {"source": "0", "target": "6"}, {"source": "1", "target": "7"}, {"source": "1", "target": "8"}, {"source": "1", "target": "2"}, {"source": "2", "target": "7"}, {"source": "2", "target": "8"}, {"source": "3", "target": "4"}, {"source": "3", "target": "5"}, {"source": "3", "target": "6"}, {"source": "4", "target": "5"}, {"source": "4", "target": "6"}, {"source": "5", "target": "6"}], "year": 2019, "authorId": {"0": "Streit,Marc", "1": "Nobre,Carolina", "2": "Lex,Alexander", "3": "Stitz,Holger", "4": "Gratzl,Samuel", "5": "Piringer,Harald", "6": "Zichner,Thomas", "7": "Gehlenborg,Nils", "8": "Coon,Hilary"}}