{"edges": [[0, 1], [0, 2], [0, 3], [0, 4], [1, 0], [1, 2], [1, 3], [1, 4], [2, 1], [2, 0], [2, 3], [2, 4], [3, 1], [3, 0], [3, 2], [3, 4], [4, 5], [4, 6], [4, 1], [4, 0], [4, 2], [4, 3]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6"}, "count": 1, "cite": 4, "position": 2.0, "connect": 1.0, "totalConnect": 1.8333333333333333, "totalCount": 0.42857142857142855, "totalCite": 6.666666666666667, "totalPosition": 4.0, "paper": [{"title": "KnowledgePearls: Provenance-Based Visualization Retrieval", "author": ["Stitz,Holger", "Gratzl,Samuel", "Piringer,Harald", "Zichner,Thomas", "Streit,Marc"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2865024", "keywords": "", "abstract": "Storing analytical provenance generates a knowledge base with a large potential for recalling previous results and guiding users in future analyses. However, without extensive manual creation of meta information and annotations by the users, search and retrieval of analysis states can become tedious. We present KnowledgePearls, a solution for efficient retrieval of analysis states that are structured as provenance graphs containing automatically recorded user interactions and visualizations. As a core component, we describe a visual interface for querying and exploring analysis states based on their similarity to a partial definition of a requested analysis state. Depending on the use case, this definition may be provided explicitly by the user by formulating a search query or inferred from given reference states. We explain our approach using the example of efficient retrieval of demographic analyses by Hans Rosling and discuss our implementation for a fast look-up of previous states. Our approach is independent of the underlying visualization framework. We discuss the applicability for visualizations which are based on the declarative grammar Vega and we use a Vega-based implementation of Gapminder as guiding example. We additionally present a biomedical case study to illustrate how KnowledgePearls facilitates the exploration process by recalling states from earlier analyses.", "cite": 4, "year": "2019"}], "name": "Gratzl,Samuel", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "0", "target": "4"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "1", "target": "4"}, {"source": "2", "target": "3"}, {"source": "2", "target": "4"}, {"source": "3", "target": "4"}, {"source": "4", "target": "5"}, {"source": "4", "target": "6"}], "year": 2019, "authorId": {"0": "Gratzl,Samuel", "1": "Stitz,Holger", "2": "Piringer,Harald", "3": "Zichner,Thomas", "4": "Streit,Marc", "5": "Nobre,Carolina", "6": "Lex,Alexander"}}