{"edges": [[0, 1], [0, 2], [0, 3], [1, 0], [1, 2], [1, 3], [2, 1], [2, 0], [2, 3], [3, 1], [3, 0], [3, 2]], "features": {"0": "0", "1": "1", "2": "2", "3": "3"}, "count": 1, "cite": 2, "position": 2.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.25, "totalCite": 2.0, "totalPosition": 4.0, "paper": [{"title": "Doccurate: A Curation-Based Approach for Clinical Text Visualization", "author": ["Sultanum,Nicole", "Singh,Devin", "Brudno,Michael", "Chevalier,Fanny"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864905", "keywords": "", "abstract": "Before seeing a patient, physicians seek to obtain an overview of the patient's medical history. Text plays a major role in this activity since it represents the bulk of the clinical documentation, but reviewing it quickly becomes onerous when patient charts grow too large. Text visualization methods have been widely explored to manage this large scale through visual summaries that rely on information retrieval algorithms to structure text and make it amenable to visualization. However, the integration with such automated approaches comes with a number of limitations, including significant error rates and the need for healthcare providers to fine-tune algorithms without expert knowledge of their inner mechanics. In addition, several of these approaches obscure or substitute the original clinical text and therefore fail to leverage qualitative and rhetorical flavours of the clinical notes. These drawbacks have limited the adoption of text visualization and other summarization technologies in clinical practice. In this work we present Doccurate, a novel system embodying a curation-based approach for the visualization of large clinical text datasets. Our approach offers automation auditing and customizability to physicians while also preserving and extensively linking to the original text. We discuss findings of a formal qualitative evaluation conducted with 6 domain experts, shedding light onto physicians' information needs, perceived strengths and limitations of automated tools, and the importance of customization while balancing efficiency. We also present use case scenarios to showcase Doccurate's envisioned usage in practice.", "cite": 2, "year": "2019"}], "name": "Singh,Devin", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "2", "target": "3"}], "year": 2019, "authorId": {"0": "Singh,Devin", "1": "Sultanum,Nicole", "2": "Brudno,Michael", "3": "Chevalier,Fanny"}}