{"edges": [[0, 1], [0, 2], [0, 3], [0, 4], [0, 5], [0, 6], [1, 2], [1, 3], [1, 0], [1, 4], [1, 5], [1, 6], [2, 1], [2, 3], [2, 0], [2, 4], [2, 5], [2, 6], [3, 1], [3, 2], [3, 0], [3, 4], [3, 5], [3, 6], [4, 1], [4, 2], [4, 3], [4, 0], [4, 5], [4, 6], [5, 1], [5, 2], [5, 3], [5, 0], [5, 4], [5, 6], [6, 1], [6, 2], [6, 3], [6, 0], [6, 4], [6, 5]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4", "5": "5", "6": "6"}, "count": 1, "cite": 5, "position": 4.0, "connect": 1.0, "totalConnect": 2.0, "totalCount": 0.14285714285714285, "totalCite": 5.0, "totalPosition": 7.0, "paper": [{"title": "BitExTract: Interactive Visualization for Extracting Bitcoin Exchange Intelligence", "author": ["Yue,Xuanwu", "Shu,Xinhuan", "Zhu,Xinyu", "Du,Xinnan", "Yu,Zheqing", "Papadopoulos,Dimitrios", "Liu,Siyuan"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2864814", "keywords": "", "abstract": "The emerging prosperity of cryptocurrencies, such as Bitcoin, has come into the spotlight during the past few years. Cryptocurrency exchanges, which act as the gateway to this world, now play a dominant role in the circulation of Bitcoin. Thus, delving into the analysis of the transaction patterns of exchanges can shed light on the evolution and trends in the Bitcoin market, and participants can gain hints for identifying credible exchanges as well. Not only Bitcoin practitioners but also researchers in the financial domains are interested in the business intelligence behind the curtain. However, the task of multiple exchanges exploration and comparisons has been limited owing to the lack of efficient tools. Previous methods of visualizing Bitcoin data have mainly concentrated on tracking suspicious transaction logs, but it is cumbersome to analyze exchanges and their relationships with existing tools and methods. In this paper, we present BitExTract, an interactive visual analytics system, which, to the best of our knowledge, is the first attempt to explore the evolutionary transaction patterns of Bitcoin exchanges from two perspectives, namely, exchange versus exchange and exchange versus client. In particular. BitExTract summarizes the evolution of the Bitcoin market by observing the transactions between exchanges over time via a massive sequence view. A node-link diagram with ego-centered views depicts the trading network of exchanges and their temporal transaction distribution. Moreover, BitExTract embeds multiple parallel bars on a timeline to examine and compare the evolution patterns of transactions between different exchanges. Three case studies with novel insights demonstrate the effectiveness and usability of our system.", "cite": 5, "year": "2019"}], "name": "Du,Xinnan", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}, {"id": "5"}, {"id": "6"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "0", "target": "3"}, {"source": "0", "target": "4"}, {"source": "0", "target": "5"}, {"source": "0", "target": "6"}, {"source": "1", "target": "2"}, {"source": "1", "target": "3"}, {"source": "1", "target": "4"}, {"source": "1", "target": "5"}, {"source": "1", "target": "6"}, {"source": "2", "target": "3"}, {"source": "2", "target": "4"}, {"source": "2", "target": "5"}, {"source": "2", "target": "6"}, {"source": "3", "target": "4"}, {"source": "3", "target": "5"}, {"source": "3", "target": "6"}, {"source": "4", "target": "5"}, {"source": "4", "target": "6"}, {"source": "5", "target": "6"}], "year": 2019, "authorId": {"0": "Du,Xinnan", "1": "Yue,Xuanwu", "2": "Shu,Xinhuan", "3": "Zhu,Xinyu", "4": "Yu,Zheqing", "5": "Papadopoulos,Dimitrios", "6": "Liu,Siyuan"}}