{"edges": [[0, 1], [0, 2], [1, 3], [1, 2], [1, 0], [1, 2], [2, 4], [2, 3], [2, 1], [2, 0], [2, 1]], "features": {"0": "0", "1": "1", "2": "2", "3": "3", "4": "4"}, "count": 1, "cite": 7, "position": 1.0, "connect": 1.0, "totalConnect": 1.8333333333333333, "totalCount": 0.8, "totalCite": 2.75, "totalPosition": 2.25, "paper": [{"title": "A Visual Analytics Framework for the Detection of Anomalous Call Stack Trees in High Performance Computing Applications", "author": ["Xie,Cong", "Xu,Wei", "Mueller,Klaus"], "soname": "IEEE TRANSACTIONS ON VISUALIZATION AND COMPUTER GRAPHICS", "DOI": "10.1109/TVCG.2018.2865026", "keywords": "", "abstract": "Anomalous runtime behavior detection is one of the most important tasks for performance diagnosis in High Performance Computing (HPC). Most of the existing methods find anomalous executions based on the properties of individual functions, such as execution time. However, it is insufficient to identify abnormal behavior without taking into account the context of the executions, such as the invocations of children functions and the communications with other HPC nodes. We improve upon the existing anomaly detection approaches by utilizing the call stack structures of the executions, which record rich temporal and contextual information. With our call stack tree (CSTree) representation of the executions, we formulate the anomaly detection problem as finding anomalous tree structures in a call stack forest. The CSTrees are converted to vector representations using our proposed stack2vec embedding. Structural and temporal visualizations of CSTrees are provided to support users in the identification and verification of the anomalies during an active anomaly detection process. Three case studies of real-world HPC applications demonstrate the capabilities of our approach.", "cite": 7, "year": "2019"}], "name": "Xie,Cong", "nodes": [{"id": "0"}, {"id": "1"}, {"id": "2"}, {"id": "3"}, {"id": "4"}], "edgess": [{"source": "0", "target": "1"}, {"source": "0", "target": "2"}, {"source": "1", "target": "3"}, {"source": "1", "target": "2"}, {"source": "2", "target": "4"}, {"source": "2", "target": "3"}], "year": 2019, "authorId": {"0": "Xie,Cong", "1": "Xu,Wei", "2": "Mueller,Klaus", "3": "Cheng,Shenghui", "4": "Bowman,Doug"}}